7767517
140 158
Input                    in0                      0 1 in0
Convolution              conv_2                   1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
HardSwish                hswish_58                1 1 1 2 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_0              1 2 2 3 4
ConvolutionDepthWise     convdwrelu_0             1 1 4 5 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution              conv_3                   1 1 5 6 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
BinaryOp                 add_0                    2 1 6 3 7 0=0
Convolution              convrelu_0               1 1 7 8 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
ConvolutionDepthWise     convdwrelu_1             1 1 8 9 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=576 7=64 9=1
Convolution              conv_5                   1 1 9 10 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Split                    splitncnn_1              1 2 10 11 12
Convolution              convrelu_1               1 1 12 13 0=72 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1728 9=1
ConvolutionDepthWise     convdwrelu_2             1 1 13 14 0=72 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=648 7=72 9=1
Convolution              conv_7                   1 1 14 15 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1728
BinaryOp                 add_1                    2 1 15 11 16 0=0
Convolution              convrelu_2               1 1 16 17 0=72 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1728 9=1
ConvolutionDepthWise     convdwrelu_3             1 1 17 18 0=72 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=1800 7=72 9=1
Split                    splitncnn_2              1 2 18 19 20
Reduction                mean_99                  1 1 20 21 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_3               1 1 21 22 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1728 9=1
Convolution              conv_10                  1 1 22 23 0=72 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1728
HardSigmoid              hsigmoid_50              1 1 23 24 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_2                    2 1 19 24 25 0=2
Convolution              conv_11                  1 1 25 26 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2880
Split                    splitncnn_3              1 2 26 27 28
Convolution              convrelu_4               1 1 28 29 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4800 9=1
ConvolutionDepthWise     convdwrelu_4             1 1 29 30 0=120 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3000 7=120 9=1
Split                    splitncnn_4              1 2 30 31 32
Reduction                mean_100                 1 1 32 33 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_5               1 1 33 34 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840 9=1
Convolution              conv_14                  1 1 34 35 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840
HardSigmoid              hsigmoid_51              1 1 35 36 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_3                    2 1 31 36 37 0=2
Convolution              conv_15                  1 1 37 38 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4800
BinaryOp                 add_4                    2 1 38 27 39 0=0
Split                    splitncnn_5              1 2 39 40 41
Convolution              convrelu_6               1 1 41 42 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4800 9=1
ConvolutionDepthWise     convdwrelu_5             1 1 42 43 0=120 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3000 7=120 9=1
Split                    splitncnn_6              1 2 43 44 45
Reduction                mean_101                 1 1 45 46 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_7               1 1 46 47 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840 9=1
Convolution              conv_18                  1 1 47 48 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840
HardSigmoid              hsigmoid_52              1 1 48 49 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_5                    2 1 44 49 50 0=2
Convolution              conv_19                  1 1 50 51 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4800
BinaryOp                 add_6                    2 1 51 40 52 0=0
Convolution              conv_20                  1 1 52 53 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9600
HardSwish                hswish_59                1 1 53 54 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_113               1 1 54 55 0=240 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2160 7=240
HardSwish                hswish_60                1 1 55 56 0=1.666667e-01 1=5.000000e-01
Convolution              conv_21                  1 1 56 57 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=19200
Split                    splitncnn_7              1 2 57 58 59
Convolution              conv_22                  1 1 59 60 0=200 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16000
HardSwish                hswish_61                1 1 60 61 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_114               1 1 61 62 0=200 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1800 7=200
HardSwish                hswish_62                1 1 62 63 0=1.666667e-01 1=5.000000e-01
Convolution              conv_23                  1 1 63 64 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16000
BinaryOp                 add_7                    2 1 64 58 65 0=0
Split                    splitncnn_8              1 2 65 66 67
Convolution              conv_24                  1 1 67 68 0=184 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14720
HardSwish                hswish_63                1 1 68 69 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_115               1 1 69 70 0=184 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1656 7=184
HardSwish                hswish_64                1 1 70 71 0=1.666667e-01 1=5.000000e-01
Convolution              conv_25                  1 1 71 72 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14720
BinaryOp                 add_8                    2 1 72 66 73 0=0
Split                    splitncnn_9              1 2 73 74 75
Convolution              conv_26                  1 1 75 76 0=184 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14720
HardSwish                hswish_65                1 1 76 77 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_116               1 1 77 78 0=184 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1656 7=184
HardSwish                hswish_66                1 1 78 79 0=1.666667e-01 1=5.000000e-01
Convolution              conv_27                  1 1 79 80 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14720
BinaryOp                 add_9                    2 1 80 74 81 0=0
Convolution              conv_28                  1 1 81 82 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=38400
HardSwish                hswish_67                1 1 82 83 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_117               1 1 83 84 0=480 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4320 7=480
HardSwish                hswish_68                1 1 84 85 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_10             1 2 85 86 87
Reduction                mean_102                 1 1 87 88 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_8               1 1 88 89 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600 9=1
Convolution              conv_30                  1 1 89 90 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
HardSigmoid              hsigmoid_53              1 1 90 91 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_10                   2 1 86 91 92 0=2
Convolution              conv_31                  1 1 92 93 0=112 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=53760
Split                    splitncnn_11             1 2 93 94 95
Convolution              conv_32                  1 1 95 96 0=672 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=75264
HardSwish                hswish_69                1 1 96 97 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_118               1 1 97 98 0=672 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=6048 7=672
HardSwish                hswish_70                1 1 98 99 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_12             1 2 99 100 101
Reduction                mean_103                 1 1 101 102 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_9               1 1 102 103 0=168 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=112896 9=1
Convolution              conv_34                  1 1 103 104 0=672 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=112896
HardSigmoid              hsigmoid_54              1 1 104 105 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_11                   2 1 100 105 106 0=2
Convolution              conv_35                  1 1 106 107 0=112 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=75264
BinaryOp                 add_12                   2 1 107 94 108 0=0
Convolution              conv_36                  1 1 108 109 0=672 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=75264
HardSwish                hswish_71                1 1 109 110 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_119               1 1 110 111 0=672 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=16800 7=672
HardSwish                hswish_72                1 1 111 112 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_13             1 2 112 113 114
Reduction                mean_104                 1 1 114 115 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_10              1 1 115 116 0=168 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=112896 9=1
Convolution              conv_38                  1 1 116 117 0=672 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=112896
HardSigmoid              hsigmoid_55              1 1 117 118 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_13                   2 1 113 118 119 0=2
Convolution              conv_39                  1 1 119 120 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=107520
Split                    splitncnn_14             1 2 120 121 122
Convolution              conv_40                  1 1 122 123 0=960 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=153600
HardSwish                hswish_73                1 1 123 124 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_120               1 1 124 125 0=960 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=24000 7=960
HardSwish                hswish_74                1 1 125 126 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_15             1 2 126 127 128
Reduction                mean_105                 1 1 128 129 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_11              1 1 129 130 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=230400 9=1
Convolution              conv_42                  1 1 130 131 0=960 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=230400
HardSigmoid              hsigmoid_56              1 1 131 132 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_14                   2 1 127 132 133 0=2
Convolution              conv_43                  1 1 133 134 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=153600
BinaryOp                 add_15                   2 1 134 121 135 0=0
Split                    splitncnn_16             1 2 135 136 137
Convolution              conv_44                  1 1 137 138 0=960 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=153600
HardSwish                hswish_75                1 1 138 139 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_121               1 1 139 140 0=960 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=24000 7=960
HardSwish                hswish_76                1 1 140 141 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_17             1 2 141 142 143
Reduction                mean_106                 1 1 143 144 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_12              1 1 144 145 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=230400 9=1
Convolution              conv_46                  1 1 145 146 0=960 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=230400
HardSigmoid              hsigmoid_57              1 1 146 147 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_16                   2 1 142 147 148 0=2
Convolution              conv_47                  1 1 148 149 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=153600
BinaryOp                 add_17                   2 1 149 136 150 0=0
Convolution              conv_48                  1 1 150 151 0=960 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=153600
HardSwish                hswish_77                1 1 151 152 0=1.666667e-01 1=5.000000e-01
Pooling                  gap_1                    1 1 152 153 0=1 4=1
Convolution              conv_49                  1 1 153 154 0=1280 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1228800
HardSwish                hswish_78                1 1 154 155 0=1.666667e-01 1=5.000000e-01
Flatten                  flatten_98               1 1 155 156
InnerProduct             linear_0                 1 1 156 out0 0=1000 1=1 2=1280000
