7767517
213 241
Input            input                    0 1 input
MemoryData       1                        0 1 1 0=1
MemoryData       340                      0 1 340 0=1 1=1 2=3
Split            splitncnn_0              1 2 340 340_splitncnn_0 340_splitncnn_1
MemoryData       342                      0 1 342 0=1 1=1 2=3
Split            splitncnn_1              1 2 342 342_splitncnn_0 342_splitncnn_1
BinaryOp         339                      1 1 input 339 0=3 1=1 2=2.550000e+02
BinaryOp         341                      2 1 339 340_splitncnn_1 341 0=1
BinaryOp         343                      2 1 341 342_splitncnn_1 343 0=3
Split            splitncnn_2              1 2 343 343_splitncnn_0 343_splitncnn_1
Convolution      344                      1 1 343_splitncnn_1 344 0=64 1=7 11=7 2=1 12=1 3=2 13=2 4=3 14=3 15=3 16=3 5=1 6=9408
ReLU             346                      1 1 344 346
Split            splitncnn_3              1 2 346 346_splitncnn_0 346_splitncnn_1
Pooling          347                      1 1 346_splitncnn_1 347 0=0 1=3 11=3 2=2 12=2 3=1 13=1 14=1 15=1 5=1
Split            splitncnn_4              1 2 347 347_splitncnn_0 347_splitncnn_1
Convolution      348                      1 1 347_splitncnn_1 348 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             350                      1 1 348 350
Convolution      351                      1 1 350 351 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
BinaryOp         353                      2 1 351 347_splitncnn_0 353 0=0
ReLU             354                      1 1 353 354
Split            splitncnn_5              1 2 354 354_splitncnn_0 354_splitncnn_1
Convolution      355                      1 1 354_splitncnn_1 355 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             357                      1 1 355 357
Convolution      358                      1 1 357 358 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
BinaryOp         360                      2 1 358 354_splitncnn_0 360 0=0
ReLU             361                      1 1 360 361
Split            splitncnn_6              1 2 361 361_splitncnn_0 361_splitncnn_1
Convolution      362                      1 1 361_splitncnn_1 362 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             364                      1 1 362 364
Convolution      365                      1 1 364 365 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
BinaryOp         367                      2 1 365 361_splitncnn_0 367 0=0
ReLU             368                      1 1 367 368
Split            splitncnn_7              1 3 368 368_splitncnn_0 368_splitncnn_1 368_splitncnn_2
Convolution      369                      1 1 368_splitncnn_2 369 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=73728
ReLU             371                      1 1 369 371
Convolution      372                      1 1 371 372 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
Convolution      374                      1 1 368_splitncnn_1 374 0=128 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=8192
BinaryOp         376                      2 1 372 374 376 0=0
ReLU             377                      1 1 376 377
Split            splitncnn_8              1 2 377 377_splitncnn_0 377_splitncnn_1
Convolution      378                      1 1 377_splitncnn_1 378 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             380                      1 1 378 380
Convolution      381                      1 1 380 381 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
BinaryOp         383                      2 1 381 377_splitncnn_0 383 0=0
ReLU             384                      1 1 383 384
Split            splitncnn_9              1 2 384 384_splitncnn_0 384_splitncnn_1
Convolution      385                      1 1 384_splitncnn_1 385 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             387                      1 1 385 387
Convolution      388                      1 1 387 388 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
BinaryOp         390                      2 1 388 384_splitncnn_0 390 0=0
ReLU             391                      1 1 390 391
Split            splitncnn_10             1 2 391 391_splitncnn_0 391_splitncnn_1
Convolution      392                      1 1 391_splitncnn_1 392 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             394                      1 1 392 394
Convolution      395                      1 1 394 395 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
BinaryOp         397                      2 1 395 391_splitncnn_0 397 0=0
ReLU             398                      1 1 397 398
Split            splitncnn_11             1 3 398 398_splitncnn_0 398_splitncnn_1 398_splitncnn_2
Convolution      399                      1 1 398_splitncnn_2 399 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=294912
ReLU             401                      1 1 399 401
Convolution      402                      1 1 401 402 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
Convolution      404                      1 1 398_splitncnn_1 404 0=256 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=32768
BinaryOp         406                      2 1 402 404 406 0=0
ReLU             407                      1 1 406 407
Split            splitncnn_12             1 2 407 407_splitncnn_0 407_splitncnn_1
Convolution      408                      1 1 407_splitncnn_1 408 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             410                      1 1 408 410
Convolution      411                      1 1 410 411 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
BinaryOp         413                      2 1 411 407_splitncnn_0 413 0=0
ReLU             414                      1 1 413 414
Split            splitncnn_13             1 2 414 414_splitncnn_0 414_splitncnn_1
Convolution      415                      1 1 414_splitncnn_1 415 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             417                      1 1 415 417
Convolution      418                      1 1 417 418 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
BinaryOp         420                      2 1 418 414_splitncnn_0 420 0=0
ReLU             421                      1 1 420 421
Split            splitncnn_14             1 2 421 421_splitncnn_0 421_splitncnn_1
Convolution      422                      1 1 421_splitncnn_1 422 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             424                      1 1 422 424
Convolution      425                      1 1 424 425 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
BinaryOp         427                      2 1 425 421_splitncnn_0 427 0=0
ReLU             428                      1 1 427 428
Split            splitncnn_15             1 2 428 428_splitncnn_0 428_splitncnn_1
Convolution      429                      1 1 428_splitncnn_1 429 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             431                      1 1 429 431
Convolution      432                      1 1 431 432 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
BinaryOp         434                      2 1 432 428_splitncnn_0 434 0=0
ReLU             435                      1 1 434 435
Split            splitncnn_16             1 2 435 435_splitncnn_0 435_splitncnn_1
Convolution      436                      1 1 435_splitncnn_1 436 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             438                      1 1 436 438
Convolution      439                      1 1 438 439 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
BinaryOp         441                      2 1 439 435_splitncnn_0 441 0=0
ReLU             442                      1 1 441 442
Split            splitncnn_17             1 3 442 442_splitncnn_0 442_splitncnn_1 442_splitncnn_2
Convolution      443                      1 1 442_splitncnn_2 443 0=512 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1179648
ReLU             445                      1 1 443 445
Convolution      446                      1 1 445 446 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
Convolution      448                      1 1 442_splitncnn_1 448 0=512 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=131072
BinaryOp         450                      2 1 446 448 450 0=0
ReLU             451                      1 1 450 451
Split            splitncnn_18             1 2 451 451_splitncnn_0 451_splitncnn_1
Convolution      452                      1 1 451_splitncnn_1 452 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
ReLU             454                      1 1 452 454
Convolution      455                      1 1 454 455 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
BinaryOp         457                      2 1 455 451_splitncnn_0 457 0=0
ReLU             458                      1 1 457 458
Split            splitncnn_19             1 2 458 458_splitncnn_0 458_splitncnn_1
Convolution      459                      1 1 458_splitncnn_1 459 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
ReLU             461                      1 1 459 461
Convolution      462                      1 1 461 462 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
BinaryOp         464                      2 1 462 458_splitncnn_0 464 0=0
ReLU             465                      1 1 464 465
BatchNorm        466                      1 1 465 466 0=512
ReLU             467                      1 1 466 467
Convolution      468                      1 1 467 468 0=1024 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=4718592
ReLU             469                      1 1 468 469
BatchNorm        470                      1 1 469 470 0=1024
Convolution      471                      1 1 470 471 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=4718592
ReLU             472                      1 1 471 472
BatchNorm        473                      1 1 472 473 0=512
Convolution      474                      1 1 473 474 0=1024 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=524288
ReLU             476                      1 1 474 476
PixelShuffle     477                      1 1 476 477 0=2 1=0
Padding          500                      1 1 477 500 0=1 1=0 2=1 3=0 4=1 5=0.000000e+00 7=0 8=0
Pooling          503                      1 1 500 503 0=1 1=2 11=2 2=1 12=1 3=0 13=0 14=0 15=0 5=1 6=0
BatchNorm        504                      1 1 442_splitncnn_0 504 0=256
Concat           505                      2 1 503 504 505 0=0
ReLU             506                      1 1 505 506
Convolution      507                      1 1 506 507 0=768 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3538944
ReLU             508                      1 1 507 508
BatchNorm        509                      1 1 508 509 0=768
Convolution      510                      1 1 509 510 0=768 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=5308416
ReLU             511                      1 1 510 511
BatchNorm        512                      1 1 511 512 0=768
Convolution      513                      1 1 512 513 0=1536 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1179648
ReLU             515                      1 1 513 515
PixelShuffle     516                      1 1 515 516 0=2 1=0
Padding          539                      1 1 516 539 0=1 1=0 2=1 3=0 4=1 5=0.000000e+00 7=0 8=0
Pooling          542                      1 1 539 542 0=1 1=2 11=2 2=1 12=1 3=0 13=0 14=0 15=0 5=1 6=0
BatchNorm        543                      1 1 398_splitncnn_0 543 0=128
Concat           544                      2 1 542 543 544 0=0
ReLU             545                      1 1 544 545
Convolution      546                      1 1 545 546 0=768 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=3538944
ReLU             547                      1 1 546 547
BatchNorm        548                      1 1 547 548 0=768
Convolution      549                      1 1 548 549 0=768 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=5308416
ReLU             550                      1 1 549 550
BatchNorm        551                      1 1 550 551 0=768
Split            splitncnn_20             1 4 551 551_splitncnn_0 551_splitncnn_1 551_splitncnn_2 551_splitncnn_3
Convolution      552                      1 1 551_splitncnn_3 552 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=73728
Convolution      553                      1 1 551_splitncnn_2 553 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=73728
Convolution      554                      1 1 551_splitncnn_1 554 0=768 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=589824
Reshape          572                      1 1 551_splitncnn_0 572 0=1 1=768 2=-1
Reshape          584                      1 1 552 584 0=1 1=96 2=-1
Reshape          596                      1 1 553 596 0=1 1=96 2=-1
Reshape          608                      1 1 554 608 0=1 1=768 2=-1
Permute          609                      1 1 584 609 0=1
Gemm             610                      2 1 609 596 610
UnaryOp          611                      1 1 610 611 0=7
Split            splitncnn_21             1 2 611 611_splitncnn_0 611_splitncnn_1
Reduction        612                      1 1 611_splitncnn_1 612 0=0 1=0 -23303=1,0 5=1
BinaryOp         613                      2 1 611_splitncnn_0 612 613 0=3
Gemm             614                      2 1 608 613 614
BinaryOp         615                      2 1 1 614 615 0=2
BinaryOp         616                      2 1 615 572 616 0=0
Reshape          622                      1 1 616 622 0=32 1=32 2=768
Convolution      623                      1 1 622 623 0=1536 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1179648
ReLU             625                      1 1 623 625
PixelShuffle     626                      1 1 625 626 0=2 1=0
Padding          649                      1 1 626 649 0=1 1=0 2=1 3=0 4=1 5=0.000000e+00 7=0 8=0
Pooling          652                      1 1 649 652 0=1 1=2 11=2 2=1 12=1 3=0 13=0 14=0 15=0 5=1 6=0
BatchNorm        653                      1 1 368_splitncnn_0 653 0=64
Concat           654                      2 1 652 653 654 0=0
ReLU             655                      1 1 654 655
Convolution      656                      1 1 655 656 0=672 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2709504
ReLU             657                      1 1 656 657
BatchNorm        658                      1 1 657 658 0=672
Convolution      659                      1 1 658 659 0=672 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=4064256
ReLU             660                      1 1 659 660
BatchNorm        661                      1 1 660 661 0=672
Convolution      662                      1 1 661 662 0=1344 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=903168
ReLU             664                      1 1 662 664
PixelShuffle     665                      1 1 664 665 0=2 1=0
Padding          688                      1 1 665 688 0=1 1=0 2=1 3=0 4=1 5=0.000000e+00 7=0 8=0
Pooling          691                      1 1 688 691 0=1 1=2 11=2 2=1 12=1 3=0 13=0 14=0 15=0 5=1 6=0
BatchNorm        692                      1 1 346_splitncnn_0 692 0=64
Concat           693                      2 1 691 692 693 0=0
ReLU             694                      1 1 693 694
Convolution      695                      1 1 694 695 0=300 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1080000
ReLU             696                      1 1 695 696
BatchNorm        697                      1 1 696 697 0=300
Convolution      698                      1 1 697 698 0=300 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=810000
ReLU             699                      1 1 698 699
BatchNorm        700                      1 1 699 700 0=300
Convolution      701                      1 1 700 701 0=1200 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=360000
ReLU             702                      1 1 701 702
PixelShuffle     703                      1 1 702 703 0=2 1=0
Concat           704                      2 1 703 343_splitncnn_0 704 0=0
Split            splitncnn_22             1 2 704 704_splitncnn_0 704_splitncnn_1
Convolution      705                      1 1 704_splitncnn_1 705 0=303 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=826281
ReLU             706                      1 1 705 706
Convolution      707                      1 1 706 707 0=303 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=826281
ReLU             708                      1 1 707 708
BinaryOp         709                      2 1 704_splitncnn_0 708 709 0=0
Convolution      710                      1 1 709 710 0=3 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=909
Sigmoid          711                      1 1 710 711
BinaryOp         713                      1 1 711 713 0=2 1=1 2=6.000000e+00
BinaryOp         715                      1 1 713 715 0=1 1=1 2=3.000000e+00
BinaryOp         717                      2 1 715 342_splitncnn_0 717 0=2
BinaryOp         719                      2 1 717 340_splitncnn_0 719 0=0
Clip             724                      1 1 719 724 0=0.000000e+00 1=1.000000e+00
BinaryOp         out                      1 1 724 out 0=2 1=1 2=2.550000e+02
