7767517
222 310
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=64 1=7 11=7 12=1 13=2 14=3 2=1 3=2 4=3 5=1 6=9408 9=1
Pooling                  maxpool2d_43             1 1 1 2 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Split                    splitncnn_0              1 2 2 3 4
Convolution              convrelu_1               1 1 4 5 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Slice                    split_0                  1 4 5 6 7 8 9 -23300=4,32,32,32,-233 1=0
Pooling                  avgpool2d_2              1 1 9 10 0=1 1=3 11=3 12=1 13=1 2=1 3=1 5=1 6=1
ConvolutionDepthWise     convdwrelu_2             1 1 6 11 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=8 9=1
ConvolutionDepthWise     convdwrelu_1             1 1 7 12 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=8 9=1
ConvolutionDepthWise     convdwrelu_0             1 1 8 13 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=8 9=1
Concat                   cat_0                    4 1 11 12 13 10 14 0=0
Convolution              conv_9                   1 1 14 15 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_8                   1 1 3 16 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_0                    2 1 15 16 17 0=0
ReLU                     relu_49                  1 1 17 18
Split                    splitncnn_1              1 2 18 19 20
Convolution              convrelu_2               1 1 20 21 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Slice                    split_1                  1 4 21 22 23 24 25 -23300=4,32,32,32,-233 1=0
ConvolutionDepthWise     convdwrelu_3             1 1 22 26 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=8 9=1
Split                    splitncnn_2              1 2 26 27 28
BinaryOp                 add_1                    2 1 28 23 29 0=0
ConvolutionDepthWise     convdwrelu_4             1 1 29 30 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=8 9=1
Split                    splitncnn_3              1 2 30 31 32
BinaryOp                 add_2                    2 1 32 24 33 0=0
ConvolutionDepthWise     convdwrelu_5             1 1 33 34 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=8 9=1
Concat                   cat_1                    4 1 27 31 34 25 35 0=0
Convolution              conv_11                  1 1 35 36 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_3                    2 1 36 19 37 0=0
ReLU                     relu_54                  1 1 37 38
Split                    splitncnn_4              1 2 38 39 40
Convolution              convrelu_3               1 1 40 41 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768 9=1
Slice                    split_2                  1 4 41 42 43 44 45 -23300=4,32,32,32,-233 1=0
ConvolutionDepthWise     convdwrelu_6             1 1 42 46 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=8 9=1
Split                    splitncnn_5              1 2 46 47 48
BinaryOp                 add_4                    2 1 48 43 49 0=0
ConvolutionDepthWise     convdwrelu_7             1 1 49 50 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=8 9=1
Split                    splitncnn_6              1 2 50 51 52
BinaryOp                 add_5                    2 1 52 44 53 0=0
ConvolutionDepthWise     convdwrelu_8             1 1 53 54 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=8 9=1
Concat                   cat_2                    4 1 47 51 54 45 55 0=0
Convolution              conv_13                  1 1 55 56 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_6                    2 1 56 39 57 0=0
ReLU                     relu_59                  1 1 57 58
Split                    splitncnn_7              1 2 58 59 60
Convolution              convrelu_4               1 1 60 61 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Slice                    split_3                  1 4 61 62 63 64 65 -23300=4,64,64,64,-233 1=0
Pooling                  avgpool2d_3              1 1 65 66 0=1 1=3 11=3 12=2 13=1 2=2 3=1 5=1 6=1
ConvolutionDepthWise     convdwrelu_11            1 1 62 67 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608 7=8 9=1
ConvolutionDepthWise     convdwrelu_10            1 1 63 68 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608 7=8 9=1
ConvolutionDepthWise     convdwrelu_9             1 1 64 69 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608 7=8 9=1
Concat                   cat_3                    4 1 67 68 69 66 70 0=0
Convolution              conv_16                  1 1 70 71 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Convolution              conv_15                  1 1 59 72 0=512 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=131072
BinaryOp                 add_7                    2 1 71 72 73 0=0
ReLU                     relu_64                  1 1 73 74
Split                    splitncnn_8              1 2 74 75 76
Convolution              convrelu_5               1 1 76 77 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=1
Slice                    split_4                  1 4 77 78 79 80 81 -23300=4,64,64,64,-233 1=0
ConvolutionDepthWise     convdwrelu_12            1 1 78 82 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=8 9=1
Split                    splitncnn_9              1 2 82 83 84
BinaryOp                 add_8                    2 1 84 79 85 0=0
ConvolutionDepthWise     convdwrelu_13            1 1 85 86 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=8 9=1
Split                    splitncnn_10             1 2 86 87 88
BinaryOp                 add_9                    2 1 88 80 89 0=0
ConvolutionDepthWise     convdwrelu_14            1 1 89 90 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=8 9=1
Concat                   cat_4                    4 1 83 87 90 81 91 0=0
Convolution              conv_18                  1 1 91 92 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_10                   2 1 92 75 93 0=0
ReLU                     relu_69                  1 1 93 94
Split                    splitncnn_11             1 2 94 95 96
Convolution              convrelu_6               1 1 96 97 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=1
Slice                    split_5                  1 4 97 98 99 100 101 -23300=4,64,64,64,-233 1=0
ConvolutionDepthWise     convdwrelu_15            1 1 98 102 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=8 9=1
Split                    splitncnn_12             1 2 102 103 104
BinaryOp                 add_11                   2 1 104 99 105 0=0
ConvolutionDepthWise     convdwrelu_16            1 1 105 106 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=8 9=1
Split                    splitncnn_13             1 2 106 107 108
BinaryOp                 add_12                   2 1 108 100 109 0=0
ConvolutionDepthWise     convdwrelu_17            1 1 109 110 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=8 9=1
Concat                   cat_5                    4 1 103 107 110 101 111 0=0
Convolution              conv_20                  1 1 111 112 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_13                   2 1 112 95 113 0=0
ReLU                     relu_74                  1 1 113 114
Split                    splitncnn_14             1 2 114 115 116
Convolution              convrelu_7               1 1 116 117 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=1
Slice                    split_6                  1 4 117 118 119 120 121 -23300=4,64,64,64,-233 1=0
ConvolutionDepthWise     convdwrelu_18            1 1 118 122 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=8 9=1
Split                    splitncnn_15             1 2 122 123 124
BinaryOp                 add_14                   2 1 124 119 125 0=0
ConvolutionDepthWise     convdwrelu_19            1 1 125 126 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=8 9=1
Split                    splitncnn_16             1 2 126 127 128
BinaryOp                 add_15                   2 1 128 120 129 0=0
ConvolutionDepthWise     convdwrelu_20            1 1 129 130 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=8 9=1
Concat                   cat_6                    4 1 123 127 130 121 131 0=0
Convolution              conv_22                  1 1 131 132 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_16                   2 1 132 115 133 0=0
ReLU                     relu_79                  1 1 133 134
Split                    splitncnn_17             1 2 134 135 136
Convolution              convrelu_8               1 1 136 137 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144 9=1
Slice                    split_7                  1 4 137 138 139 140 141 -23300=4,128,128,128,-233 1=0
Pooling                  avgpool2d_4              1 1 141 142 0=1 1=3 11=3 12=2 13=1 2=2 3=1 5=1 6=1
ConvolutionDepthWise     convdwrelu_23            1 1 138 143 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432 7=8 9=1
ConvolutionDepthWise     convdwrelu_22            1 1 139 144 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432 7=8 9=1
ConvolutionDepthWise     convdwrelu_21            1 1 140 145 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432 7=8 9=1
Concat                   cat_7                    4 1 143 144 145 142 146 0=0
Convolution              conv_25                  1 1 146 147 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Convolution              conv_24                  1 1 135 148 0=1024 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=524288
BinaryOp                 add_17                   2 1 147 148 149 0=0
ReLU                     relu_84                  1 1 149 150
Split                    splitncnn_18             1 2 150 151 152
Convolution              convrelu_9               1 1 152 153 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
Slice                    split_8                  1 4 153 154 155 156 157 -23300=4,128,128,128,-233 1=0
ConvolutionDepthWise     convdwrelu_24            1 1 154 158 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 7=8 9=1
Split                    splitncnn_19             1 2 158 159 160
BinaryOp                 add_18                   2 1 160 155 161 0=0
ConvolutionDepthWise     convdwrelu_25            1 1 161 162 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 7=8 9=1
Split                    splitncnn_20             1 2 162 163 164
BinaryOp                 add_19                   2 1 164 156 165 0=0
ConvolutionDepthWise     convdwrelu_26            1 1 165 166 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 7=8 9=1
Concat                   cat_8                    4 1 159 163 166 157 167 0=0
Convolution              conv_27                  1 1 167 168 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
BinaryOp                 add_20                   2 1 168 151 169 0=0
ReLU                     relu_89                  1 1 169 170
Split                    splitncnn_21             1 2 170 171 172
Convolution              convrelu_10              1 1 172 173 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
Slice                    split_9                  1 4 173 174 175 176 177 -23300=4,128,128,128,-233 1=0
ConvolutionDepthWise     convdwrelu_27            1 1 174 178 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 7=8 9=1
Split                    splitncnn_22             1 2 178 179 180
BinaryOp                 add_21                   2 1 180 175 181 0=0
ConvolutionDepthWise     convdwrelu_28            1 1 181 182 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 7=8 9=1
Split                    splitncnn_23             1 2 182 183 184
BinaryOp                 add_22                   2 1 184 176 185 0=0
ConvolutionDepthWise     convdwrelu_29            1 1 185 186 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 7=8 9=1
Concat                   cat_9                    4 1 179 183 186 177 187 0=0
Convolution              conv_29                  1 1 187 188 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
BinaryOp                 add_23                   2 1 188 171 189 0=0
ReLU                     relu_94                  1 1 189 190
Split                    splitncnn_24             1 2 190 191 192
Convolution              convrelu_11              1 1 192 193 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
Slice                    split_10                 1 4 193 194 195 196 197 -23300=4,128,128,128,-233 1=0
ConvolutionDepthWise     convdwrelu_30            1 1 194 198 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 7=8 9=1
Split                    splitncnn_25             1 2 198 199 200
BinaryOp                 add_24                   2 1 200 195 201 0=0
ConvolutionDepthWise     convdwrelu_31            1 1 201 202 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 7=8 9=1
Split                    splitncnn_26             1 2 202 203 204
BinaryOp                 add_25                   2 1 204 196 205 0=0
ConvolutionDepthWise     convdwrelu_32            1 1 205 206 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 7=8 9=1
Concat                   cat_10                   4 1 199 203 206 197 207 0=0
Convolution              conv_31                  1 1 207 208 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
BinaryOp                 add_26                   2 1 208 191 209 0=0
ReLU                     relu_99                  1 1 209 210
Split                    splitncnn_27             1 2 210 211 212
Convolution              convrelu_12              1 1 212 213 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
Slice                    split_11                 1 4 213 214 215 216 217 -23300=4,128,128,128,-233 1=0
ConvolutionDepthWise     convdwrelu_33            1 1 214 218 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 7=8 9=1
Split                    splitncnn_28             1 2 218 219 220
BinaryOp                 add_27                   2 1 220 215 221 0=0
ConvolutionDepthWise     convdwrelu_34            1 1 221 222 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 7=8 9=1
Split                    splitncnn_29             1 2 222 223 224
BinaryOp                 add_28                   2 1 224 216 225 0=0
ConvolutionDepthWise     convdwrelu_35            1 1 225 226 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 7=8 9=1
Concat                   cat_11                   4 1 219 223 226 217 227 0=0
Convolution              conv_33                  1 1 227 228 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
BinaryOp                 add_29                   2 1 228 211 229 0=0
ReLU                     relu_104                 1 1 229 230
Split                    splitncnn_30             1 2 230 231 232
Convolution              convrelu_13              1 1 232 233 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
Slice                    split_12                 1 4 233 234 235 236 237 -23300=4,128,128,128,-233 1=0
ConvolutionDepthWise     convdwrelu_36            1 1 234 238 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 7=8 9=1
Split                    splitncnn_31             1 2 238 239 240
BinaryOp                 add_30                   2 1 240 235 241 0=0
ConvolutionDepthWise     convdwrelu_37            1 1 241 242 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 7=8 9=1
Split                    splitncnn_32             1 2 242 243 244
BinaryOp                 add_31                   2 1 244 236 245 0=0
ConvolutionDepthWise     convdwrelu_38            1 1 245 246 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 7=8 9=1
Concat                   cat_12                   4 1 239 243 246 237 247 0=0
Convolution              conv_35                  1 1 247 248 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
BinaryOp                 add_32                   2 1 248 231 249 0=0
ReLU                     relu_109                 1 1 249 250
Split                    splitncnn_33             1 2 250 251 252
Convolution              convrelu_14              1 1 252 253 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1048576 9=1
Slice                    split_13                 1 4 253 254 255 256 257 -23300=4,256,256,256,-233 1=0
Pooling                  avgpool2d_5              1 1 257 258 0=1 1=3 11=3 12=2 13=1 2=2 3=1 5=1 6=1
ConvolutionDepthWise     convdwrelu_41            1 1 254 259 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728 7=8 9=1
ConvolutionDepthWise     convdwrelu_40            1 1 255 260 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728 7=8 9=1
ConvolutionDepthWise     convdwrelu_39            1 1 256 261 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728 7=8 9=1
Concat                   cat_13                   4 1 259 260 261 258 262 0=0
Convolution              conv_38                  1 1 262 263 0=2048 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2097152
Convolution              conv_37                  1 1 251 264 0=2048 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=2097152
BinaryOp                 add_33                   2 1 263 264 265 0=0
ReLU                     relu_114                 1 1 265 266
Split                    splitncnn_34             1 2 266 267 268
Convolution              convrelu_15              1 1 268 269 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2097152 9=1
Slice                    split_14                 1 4 269 270 271 272 273 -23300=4,256,256,256,-233 1=0
ConvolutionDepthWise     convdwrelu_42            1 1 270 274 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 7=8 9=1
Split                    splitncnn_35             1 2 274 275 276
BinaryOp                 add_34                   2 1 276 271 277 0=0
ConvolutionDepthWise     convdwrelu_43            1 1 277 278 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 7=8 9=1
Split                    splitncnn_36             1 2 278 279 280
BinaryOp                 add_35                   2 1 280 272 281 0=0
ConvolutionDepthWise     convdwrelu_44            1 1 281 282 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 7=8 9=1
Concat                   cat_14                   4 1 275 279 282 273 283 0=0
Convolution              conv_40                  1 1 283 284 0=2048 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2097152
BinaryOp                 add_36                   2 1 284 267 285 0=0
ReLU                     relu_119                 1 1 285 286
Split                    splitncnn_37             1 2 286 287 288
Convolution              convrelu_16              1 1 288 289 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2097152 9=1
Slice                    split_15                 1 4 289 290 291 292 293 -23300=4,256,256,256,-233 1=0
ConvolutionDepthWise     convdwrelu_45            1 1 290 294 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 7=8 9=1
Split                    splitncnn_38             1 2 294 295 296
BinaryOp                 add_37                   2 1 296 291 297 0=0
ConvolutionDepthWise     convdwrelu_46            1 1 297 298 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 7=8 9=1
Split                    splitncnn_39             1 2 298 299 300
BinaryOp                 add_38                   2 1 300 292 301 0=0
ConvolutionDepthWise     convdwrelu_47            1 1 301 302 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 7=8 9=1
Concat                   cat_15                   4 1 295 299 302 293 303 0=0
Convolution              conv_42                  1 1 303 304 0=2048 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2097152
BinaryOp                 add_39                   2 1 304 287 305 0=0
ReLU                     relu_124                 1 1 305 306
Pooling                  gap_1                    1 1 306 307 0=1 4=1
Flatten                  flatten_125              1 1 307 308
InnerProduct             linear_0                 1 1 308 out0 0=1000 1=1 2=2048000
