7767517
460 650
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=64 1=7 11=7 12=1 13=2 14=3 2=1 3=2 4=3 5=1 6=9408 9=1
Pooling                  maxpool2d_176            1 1 1 2 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Split                    splitncnn_0              1 2 2 3 4
Convolution              convrelu_1               1 1 4 5 0=104 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6656 9=1
Slice                    split_0                  1 4 5 6 7 8 9 -23300=4,26,26,26,-233 1=0
Pooling                  avgpool2d_2              1 1 9 10 0=1 1=3 11=3 12=1 13=1 2=1 3=1 5=1 6=1
Convolution              convrelu_4               1 1 6 11 0=26 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=6084 9=1
Convolution              convrelu_3               1 1 7 12 0=26 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=6084 9=1
Convolution              convrelu_2               1 1 8 13 0=26 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=6084 9=1
Concat                   cat_0                    4 1 11 12 13 10 14 0=0
Convolution              conv_12                  1 1 14 15 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=26624
Convolution              conv_11                  1 1 3 16 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_0                    2 1 15 16 17 0=0
ReLU                     relu_182                 1 1 17 18
Split                    splitncnn_1              1 2 18 19 20
Convolution              convrelu_5               1 1 20 21 0=104 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=26624 9=1
Slice                    split_1                  1 4 21 22 23 24 25 -23300=4,26,26,26,-233 1=0
Convolution              convrelu_6               1 1 22 26 0=26 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=6084 9=1
Split                    splitncnn_2              1 2 26 27 28
BinaryOp                 add_1                    2 1 28 23 29 0=0
Convolution              convrelu_7               1 1 29 30 0=26 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=6084 9=1
Split                    splitncnn_3              1 2 30 31 32
BinaryOp                 add_2                    2 1 32 24 33 0=0
Convolution              convrelu_8               1 1 33 34 0=26 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=6084 9=1
Concat                   cat_1                    4 1 27 31 34 25 35 0=0
Convolution              conv_17                  1 1 35 36 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=26624
BinaryOp                 add_3                    2 1 36 19 37 0=0
ReLU                     relu_187                 1 1 37 38
Split                    splitncnn_4              1 2 38 39 40
Convolution              convrelu_9               1 1 40 41 0=104 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=26624 9=1
Slice                    split_2                  1 4 41 42 43 44 45 -23300=4,26,26,26,-233 1=0
Convolution              convrelu_10              1 1 42 46 0=26 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=6084 9=1
Split                    splitncnn_5              1 2 46 47 48
BinaryOp                 add_4                    2 1 48 43 49 0=0
Convolution              convrelu_11              1 1 49 50 0=26 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=6084 9=1
Split                    splitncnn_6              1 2 50 51 52
BinaryOp                 add_5                    2 1 52 44 53 0=0
Convolution              convrelu_12              1 1 53 54 0=26 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=6084 9=1
Concat                   cat_2                    4 1 47 51 54 45 55 0=0
Convolution              conv_22                  1 1 55 56 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=26624
BinaryOp                 add_6                    2 1 56 39 57 0=0
ReLU                     relu_192                 1 1 57 58
Split                    splitncnn_7              1 2 58 59 60
Convolution              convrelu_13              1 1 60 61 0=208 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=53248 9=1
Slice                    split_3                  1 4 61 62 63 64 65 -23300=4,52,52,52,-233 1=0
Pooling                  avgpool2d_3              1 1 65 66 0=1 1=3 11=3 12=2 13=1 2=2 3=1 5=1 6=1
Convolution              convrelu_16              1 1 62 67 0=52 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=24336 9=1
Convolution              convrelu_15              1 1 63 68 0=52 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=24336 9=1
Convolution              convrelu_14              1 1 64 69 0=52 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=24336 9=1
Concat                   cat_3                    4 1 67 68 69 66 70 0=0
Convolution              conv_28                  1 1 70 71 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=106496
Convolution              conv_27                  1 1 59 72 0=512 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=131072
BinaryOp                 add_7                    2 1 71 72 73 0=0
ReLU                     relu_197                 1 1 73 74
Split                    splitncnn_8              1 2 74 75 76
Convolution              convrelu_17              1 1 76 77 0=208 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=106496 9=1
Slice                    split_4                  1 4 77 78 79 80 81 -23300=4,52,52,52,-233 1=0
Convolution              convrelu_18              1 1 78 82 0=52 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=24336 9=1
Split                    splitncnn_9              1 2 82 83 84
BinaryOp                 add_8                    2 1 84 79 85 0=0
Convolution              convrelu_19              1 1 85 86 0=52 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=24336 9=1
Split                    splitncnn_10             1 2 86 87 88
BinaryOp                 add_9                    2 1 88 80 89 0=0
Convolution              convrelu_20              1 1 89 90 0=52 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=24336 9=1
Concat                   cat_4                    4 1 83 87 90 81 91 0=0
Convolution              conv_33                  1 1 91 92 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=106496
BinaryOp                 add_10                   2 1 92 75 93 0=0
ReLU                     relu_202                 1 1 93 94
Split                    splitncnn_11             1 2 94 95 96
Convolution              convrelu_21              1 1 96 97 0=208 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=106496 9=1
Slice                    split_5                  1 4 97 98 99 100 101 -23300=4,52,52,52,-233 1=0
Convolution              convrelu_22              1 1 98 102 0=52 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=24336 9=1
Split                    splitncnn_12             1 2 102 103 104
BinaryOp                 add_11                   2 1 104 99 105 0=0
Convolution              convrelu_23              1 1 105 106 0=52 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=24336 9=1
Split                    splitncnn_13             1 2 106 107 108
BinaryOp                 add_12                   2 1 108 100 109 0=0
Convolution              convrelu_24              1 1 109 110 0=52 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=24336 9=1
Concat                   cat_5                    4 1 103 107 110 101 111 0=0
Convolution              conv_38                  1 1 111 112 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=106496
BinaryOp                 add_13                   2 1 112 95 113 0=0
ReLU                     relu_207                 1 1 113 114
Split                    splitncnn_14             1 2 114 115 116
Convolution              convrelu_25              1 1 116 117 0=208 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=106496 9=1
Slice                    split_6                  1 4 117 118 119 120 121 -23300=4,52,52,52,-233 1=0
Convolution              convrelu_26              1 1 118 122 0=52 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=24336 9=1
Split                    splitncnn_15             1 2 122 123 124
BinaryOp                 add_14                   2 1 124 119 125 0=0
Convolution              convrelu_27              1 1 125 126 0=52 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=24336 9=1
Split                    splitncnn_16             1 2 126 127 128
BinaryOp                 add_15                   2 1 128 120 129 0=0
Convolution              convrelu_28              1 1 129 130 0=52 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=24336 9=1
Concat                   cat_6                    4 1 123 127 130 121 131 0=0
Convolution              conv_43                  1 1 131 132 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=106496
BinaryOp                 add_16                   2 1 132 115 133 0=0
ReLU                     relu_212                 1 1 133 134
Split                    splitncnn_17             1 2 134 135 136
Convolution              convrelu_29              1 1 136 137 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=212992 9=1
Slice                    split_7                  1 4 137 138 139 140 141 -23300=4,104,104,104,-233 1=0
Pooling                  avgpool2d_4              1 1 141 142 0=1 1=3 11=3 12=2 13=1 2=2 3=1 5=1 6=1
Convolution              convrelu_32              1 1 138 143 0=104 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=97344 9=1
Convolution              convrelu_31              1 1 139 144 0=104 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=97344 9=1
Convolution              convrelu_30              1 1 140 145 0=104 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=97344 9=1
Concat                   cat_7                    4 1 143 144 145 142 146 0=0
Convolution              conv_49                  1 1 146 147 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
Convolution              conv_48                  1 1 135 148 0=1024 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=524288
BinaryOp                 add_17                   2 1 147 148 149 0=0
ReLU                     relu_217                 1 1 149 150
Split                    splitncnn_18             1 2 150 151 152
Convolution              convrelu_33              1 1 152 153 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_8                  1 4 153 154 155 156 157 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_34              1 1 154 158 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_19             1 2 158 159 160
BinaryOp                 add_18                   2 1 160 155 161 0=0
Convolution              convrelu_35              1 1 161 162 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_20             1 2 162 163 164
BinaryOp                 add_19                   2 1 164 156 165 0=0
Convolution              convrelu_36              1 1 165 166 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_8                    4 1 159 163 166 157 167 0=0
Convolution              conv_54                  1 1 167 168 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_20                   2 1 168 151 169 0=0
ReLU                     relu_222                 1 1 169 170
Split                    splitncnn_21             1 2 170 171 172
Convolution              convrelu_37              1 1 172 173 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_9                  1 4 173 174 175 176 177 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_38              1 1 174 178 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_22             1 2 178 179 180
BinaryOp                 add_21                   2 1 180 175 181 0=0
Convolution              convrelu_39              1 1 181 182 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_23             1 2 182 183 184
BinaryOp                 add_22                   2 1 184 176 185 0=0
Convolution              convrelu_40              1 1 185 186 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_9                    4 1 179 183 186 177 187 0=0
Convolution              conv_59                  1 1 187 188 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_23                   2 1 188 171 189 0=0
ReLU                     relu_227                 1 1 189 190
Split                    splitncnn_24             1 2 190 191 192
Convolution              convrelu_41              1 1 192 193 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_10                 1 4 193 194 195 196 197 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_42              1 1 194 198 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_25             1 2 198 199 200
BinaryOp                 add_24                   2 1 200 195 201 0=0
Convolution              convrelu_43              1 1 201 202 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_26             1 2 202 203 204
BinaryOp                 add_25                   2 1 204 196 205 0=0
Convolution              convrelu_44              1 1 205 206 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_10                   4 1 199 203 206 197 207 0=0
Convolution              conv_64                  1 1 207 208 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_26                   2 1 208 191 209 0=0
ReLU                     relu_232                 1 1 209 210
Split                    splitncnn_27             1 2 210 211 212
Convolution              convrelu_45              1 1 212 213 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_11                 1 4 213 214 215 216 217 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_46              1 1 214 218 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_28             1 2 218 219 220
BinaryOp                 add_27                   2 1 220 215 221 0=0
Convolution              convrelu_47              1 1 221 222 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_29             1 2 222 223 224
BinaryOp                 add_28                   2 1 224 216 225 0=0
Convolution              convrelu_48              1 1 225 226 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_11                   4 1 219 223 226 217 227 0=0
Convolution              conv_69                  1 1 227 228 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_29                   2 1 228 211 229 0=0
ReLU                     relu_237                 1 1 229 230
Split                    splitncnn_30             1 2 230 231 232
Convolution              convrelu_49              1 1 232 233 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_12                 1 4 233 234 235 236 237 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_50              1 1 234 238 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_31             1 2 238 239 240
BinaryOp                 add_30                   2 1 240 235 241 0=0
Convolution              convrelu_51              1 1 241 242 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_32             1 2 242 243 244
BinaryOp                 add_31                   2 1 244 236 245 0=0
Convolution              convrelu_52              1 1 245 246 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_12                   4 1 239 243 246 237 247 0=0
Convolution              conv_74                  1 1 247 248 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_32                   2 1 248 231 249 0=0
ReLU                     relu_242                 1 1 249 250
Split                    splitncnn_33             1 2 250 251 252
Convolution              convrelu_53              1 1 252 253 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_13                 1 4 253 254 255 256 257 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_54              1 1 254 258 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_34             1 2 258 259 260
BinaryOp                 add_33                   2 1 260 255 261 0=0
Convolution              convrelu_55              1 1 261 262 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_35             1 2 262 263 264
BinaryOp                 add_34                   2 1 264 256 265 0=0
Convolution              convrelu_56              1 1 265 266 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_13                   4 1 259 263 266 257 267 0=0
Convolution              conv_79                  1 1 267 268 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_35                   2 1 268 251 269 0=0
ReLU                     relu_247                 1 1 269 270
Split                    splitncnn_36             1 2 270 271 272
Convolution              convrelu_57              1 1 272 273 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_14                 1 4 273 274 275 276 277 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_58              1 1 274 278 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_37             1 2 278 279 280
BinaryOp                 add_36                   2 1 280 275 281 0=0
Convolution              convrelu_59              1 1 281 282 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_38             1 2 282 283 284
BinaryOp                 add_37                   2 1 284 276 285 0=0
Convolution              convrelu_60              1 1 285 286 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_14                   4 1 279 283 286 277 287 0=0
Convolution              conv_84                  1 1 287 288 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_38                   2 1 288 271 289 0=0
ReLU                     relu_252                 1 1 289 290
Split                    splitncnn_39             1 2 290 291 292
Convolution              convrelu_61              1 1 292 293 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_15                 1 4 293 294 295 296 297 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_62              1 1 294 298 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_40             1 2 298 299 300
BinaryOp                 add_39                   2 1 300 295 301 0=0
Convolution              convrelu_63              1 1 301 302 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_41             1 2 302 303 304
BinaryOp                 add_40                   2 1 304 296 305 0=0
Convolution              convrelu_64              1 1 305 306 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_15                   4 1 299 303 306 297 307 0=0
Convolution              conv_89                  1 1 307 308 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_41                   2 1 308 291 309 0=0
ReLU                     relu_257                 1 1 309 310
Split                    splitncnn_42             1 2 310 311 312
Convolution              convrelu_65              1 1 312 313 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_16                 1 4 313 314 315 316 317 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_66              1 1 314 318 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_43             1 2 318 319 320
BinaryOp                 add_42                   2 1 320 315 321 0=0
Convolution              convrelu_67              1 1 321 322 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_44             1 2 322 323 324
BinaryOp                 add_43                   2 1 324 316 325 0=0
Convolution              convrelu_68              1 1 325 326 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_16                   4 1 319 323 326 317 327 0=0
Convolution              conv_94                  1 1 327 328 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_44                   2 1 328 311 329 0=0
ReLU                     relu_262                 1 1 329 330
Split                    splitncnn_45             1 2 330 331 332
Convolution              convrelu_69              1 1 332 333 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_17                 1 4 333 334 335 336 337 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_70              1 1 334 338 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_46             1 2 338 339 340
BinaryOp                 add_45                   2 1 340 335 341 0=0
Convolution              convrelu_71              1 1 341 342 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_47             1 2 342 343 344
BinaryOp                 add_46                   2 1 344 336 345 0=0
Convolution              convrelu_72              1 1 345 346 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_17                   4 1 339 343 346 337 347 0=0
Convolution              conv_99                  1 1 347 348 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_47                   2 1 348 331 349 0=0
ReLU                     relu_267                 1 1 349 350
Split                    splitncnn_48             1 2 350 351 352
Convolution              convrelu_73              1 1 352 353 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_18                 1 4 353 354 355 356 357 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_74              1 1 354 358 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_49             1 2 358 359 360
BinaryOp                 add_48                   2 1 360 355 361 0=0
Convolution              convrelu_75              1 1 361 362 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_50             1 2 362 363 364
BinaryOp                 add_49                   2 1 364 356 365 0=0
Convolution              convrelu_76              1 1 365 366 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_18                   4 1 359 363 366 357 367 0=0
Convolution              conv_104                 1 1 367 368 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_50                   2 1 368 351 369 0=0
ReLU                     relu_272                 1 1 369 370
Split                    splitncnn_51             1 2 370 371 372
Convolution              convrelu_77              1 1 372 373 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_19                 1 4 373 374 375 376 377 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_78              1 1 374 378 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_52             1 2 378 379 380
BinaryOp                 add_51                   2 1 380 375 381 0=0
Convolution              convrelu_79              1 1 381 382 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_53             1 2 382 383 384
BinaryOp                 add_52                   2 1 384 376 385 0=0
Convolution              convrelu_80              1 1 385 386 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_19                   4 1 379 383 386 377 387 0=0
Convolution              conv_109                 1 1 387 388 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_53                   2 1 388 371 389 0=0
ReLU                     relu_277                 1 1 389 390
Split                    splitncnn_54             1 2 390 391 392
Convolution              convrelu_81              1 1 392 393 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_20                 1 4 393 394 395 396 397 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_82              1 1 394 398 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_55             1 2 398 399 400
BinaryOp                 add_54                   2 1 400 395 401 0=0
Convolution              convrelu_83              1 1 401 402 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_56             1 2 402 403 404
BinaryOp                 add_55                   2 1 404 396 405 0=0
Convolution              convrelu_84              1 1 405 406 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_20                   4 1 399 403 406 397 407 0=0
Convolution              conv_114                 1 1 407 408 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_56                   2 1 408 391 409 0=0
ReLU                     relu_282                 1 1 409 410
Split                    splitncnn_57             1 2 410 411 412
Convolution              convrelu_85              1 1 412 413 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_21                 1 4 413 414 415 416 417 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_86              1 1 414 418 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_58             1 2 418 419 420
BinaryOp                 add_57                   2 1 420 415 421 0=0
Convolution              convrelu_87              1 1 421 422 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_59             1 2 422 423 424
BinaryOp                 add_58                   2 1 424 416 425 0=0
Convolution              convrelu_88              1 1 425 426 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_21                   4 1 419 423 426 417 427 0=0
Convolution              conv_119                 1 1 427 428 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_59                   2 1 428 411 429 0=0
ReLU                     relu_287                 1 1 429 430
Split                    splitncnn_60             1 2 430 431 432
Convolution              convrelu_89              1 1 432 433 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_22                 1 4 433 434 435 436 437 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_90              1 1 434 438 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_61             1 2 438 439 440
BinaryOp                 add_60                   2 1 440 435 441 0=0
Convolution              convrelu_91              1 1 441 442 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_62             1 2 442 443 444
BinaryOp                 add_61                   2 1 444 436 445 0=0
Convolution              convrelu_92              1 1 445 446 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_22                   4 1 439 443 446 437 447 0=0
Convolution              conv_124                 1 1 447 448 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_62                   2 1 448 431 449 0=0
ReLU                     relu_292                 1 1 449 450
Split                    splitncnn_63             1 2 450 451 452
Convolution              convrelu_93              1 1 452 453 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_23                 1 4 453 454 455 456 457 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_94              1 1 454 458 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_64             1 2 458 459 460
BinaryOp                 add_63                   2 1 460 455 461 0=0
Convolution              convrelu_95              1 1 461 462 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_65             1 2 462 463 464
BinaryOp                 add_64                   2 1 464 456 465 0=0
Convolution              convrelu_96              1 1 465 466 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_23                   4 1 459 463 466 457 467 0=0
Convolution              conv_129                 1 1 467 468 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_65                   2 1 468 451 469 0=0
ReLU                     relu_297                 1 1 469 470
Split                    splitncnn_66             1 2 470 471 472
Convolution              convrelu_97              1 1 472 473 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_24                 1 4 473 474 475 476 477 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_98              1 1 474 478 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_67             1 2 478 479 480
BinaryOp                 add_66                   2 1 480 475 481 0=0
Convolution              convrelu_99              1 1 481 482 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_68             1 2 482 483 484
BinaryOp                 add_67                   2 1 484 476 485 0=0
Convolution              convrelu_100             1 1 485 486 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_24                   4 1 479 483 486 477 487 0=0
Convolution              conv_134                 1 1 487 488 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_68                   2 1 488 471 489 0=0
ReLU                     relu_302                 1 1 489 490
Split                    splitncnn_69             1 2 490 491 492
Convolution              convrelu_101             1 1 492 493 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_25                 1 4 493 494 495 496 497 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_102             1 1 494 498 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_70             1 2 498 499 500
BinaryOp                 add_69                   2 1 500 495 501 0=0
Convolution              convrelu_103             1 1 501 502 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_71             1 2 502 503 504
BinaryOp                 add_70                   2 1 504 496 505 0=0
Convolution              convrelu_104             1 1 505 506 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_25                   4 1 499 503 506 497 507 0=0
Convolution              conv_139                 1 1 507 508 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_71                   2 1 508 491 509 0=0
ReLU                     relu_307                 1 1 509 510
Split                    splitncnn_72             1 2 510 511 512
Convolution              convrelu_105             1 1 512 513 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_26                 1 4 513 514 515 516 517 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_106             1 1 514 518 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_73             1 2 518 519 520
BinaryOp                 add_72                   2 1 520 515 521 0=0
Convolution              convrelu_107             1 1 521 522 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_74             1 2 522 523 524
BinaryOp                 add_73                   2 1 524 516 525 0=0
Convolution              convrelu_108             1 1 525 526 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_26                   4 1 519 523 526 517 527 0=0
Convolution              conv_144                 1 1 527 528 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_74                   2 1 528 511 529 0=0
ReLU                     relu_312                 1 1 529 530
Split                    splitncnn_75             1 2 530 531 532
Convolution              convrelu_109             1 1 532 533 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_27                 1 4 533 534 535 536 537 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_110             1 1 534 538 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_76             1 2 538 539 540
BinaryOp                 add_75                   2 1 540 535 541 0=0
Convolution              convrelu_111             1 1 541 542 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_77             1 2 542 543 544
BinaryOp                 add_76                   2 1 544 536 545 0=0
Convolution              convrelu_112             1 1 545 546 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_27                   4 1 539 543 546 537 547 0=0
Convolution              conv_149                 1 1 547 548 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_77                   2 1 548 531 549 0=0
ReLU                     relu_317                 1 1 549 550
Split                    splitncnn_78             1 2 550 551 552
Convolution              convrelu_113             1 1 552 553 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_28                 1 4 553 554 555 556 557 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_114             1 1 554 558 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_79             1 2 558 559 560
BinaryOp                 add_78                   2 1 560 555 561 0=0
Convolution              convrelu_115             1 1 561 562 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_80             1 2 562 563 564
BinaryOp                 add_79                   2 1 564 556 565 0=0
Convolution              convrelu_116             1 1 565 566 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_28                   4 1 559 563 566 557 567 0=0
Convolution              conv_154                 1 1 567 568 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_80                   2 1 568 551 569 0=0
ReLU                     relu_322                 1 1 569 570
Split                    splitncnn_81             1 2 570 571 572
Convolution              convrelu_117             1 1 572 573 0=416 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984 9=1
Slice                    split_29                 1 4 573 574 575 576 577 -23300=4,104,104,104,-233 1=0
Convolution              convrelu_118             1 1 574 578 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_82             1 2 578 579 580
BinaryOp                 add_81                   2 1 580 575 581 0=0
Convolution              convrelu_119             1 1 581 582 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Split                    splitncnn_83             1 2 582 583 584
BinaryOp                 add_82                   2 1 584 576 585 0=0
Convolution              convrelu_120             1 1 585 586 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=97344 9=1
Concat                   cat_29                   4 1 579 583 586 577 587 0=0
Convolution              conv_159                 1 1 587 588 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=425984
BinaryOp                 add_83                   2 1 588 571 589 0=0
ReLU                     relu_327                 1 1 589 590
Split                    splitncnn_84             1 2 590 591 592
Convolution              convrelu_121             1 1 592 593 0=832 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=851968 9=1
Slice                    split_30                 1 4 593 594 595 596 597 -23300=4,208,208,208,-233 1=0
Pooling                  avgpool2d_5              1 1 597 598 0=1 1=3 11=3 12=2 13=1 2=2 3=1 5=1 6=1
Convolution              convrelu_124             1 1 594 599 0=208 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=389376 9=1
Convolution              convrelu_123             1 1 595 600 0=208 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=389376 9=1
Convolution              convrelu_122             1 1 596 601 0=208 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=389376 9=1
Concat                   cat_30                   4 1 599 600 601 598 602 0=0
Convolution              conv_165                 1 1 602 603 0=2048 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1703936
Convolution              conv_164                 1 1 591 604 0=2048 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=2097152
BinaryOp                 add_84                   2 1 603 604 605 0=0
ReLU                     relu_332                 1 1 605 606
Split                    splitncnn_85             1 2 606 607 608
Convolution              convrelu_125             1 1 608 609 0=832 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1703936 9=1
Slice                    split_31                 1 4 609 610 611 612 613 -23300=4,208,208,208,-233 1=0
Convolution              convrelu_126             1 1 610 614 0=208 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=389376 9=1
Split                    splitncnn_86             1 2 614 615 616
BinaryOp                 add_85                   2 1 616 611 617 0=0
Convolution              convrelu_127             1 1 617 618 0=208 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=389376 9=1
Split                    splitncnn_87             1 2 618 619 620
BinaryOp                 add_86                   2 1 620 612 621 0=0
Convolution              convrelu_128             1 1 621 622 0=208 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=389376 9=1
Concat                   cat_31                   4 1 615 619 622 613 623 0=0
Convolution              conv_170                 1 1 623 624 0=2048 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1703936
BinaryOp                 add_87                   2 1 624 607 625 0=0
ReLU                     relu_337                 1 1 625 626
Split                    splitncnn_88             1 2 626 627 628
Convolution              convrelu_129             1 1 628 629 0=832 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1703936 9=1
Slice                    split_32                 1 4 629 630 631 632 633 -23300=4,208,208,208,-233 1=0
Convolution              convrelu_130             1 1 630 634 0=208 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=389376 9=1
Split                    splitncnn_89             1 2 634 635 636
BinaryOp                 add_88                   2 1 636 631 637 0=0
Convolution              convrelu_131             1 1 637 638 0=208 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=389376 9=1
Split                    splitncnn_90             1 2 638 639 640
BinaryOp                 add_89                   2 1 640 632 641 0=0
Convolution              convrelu_132             1 1 641 642 0=208 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=389376 9=1
Concat                   cat_32                   4 1 635 639 642 633 643 0=0
Convolution              conv_175                 1 1 643 644 0=2048 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1703936
BinaryOp                 add_90                   2 1 644 627 645 0=0
ReLU                     relu_342                 1 1 645 646
Pooling                  gap_1                    1 1 646 647 0=1 4=1
Flatten                  flatten_343              1 1 647 648
InnerProduct             linear_0                 1 1 648 out0 0=1000 1=1 2=2048000
