7767517
24 24
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 9=1
Convolution              convrelu_1               1 1 1 2 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Pooling                  maxpool2d_16             1 1 2 3 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_2               1 1 3 4 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 9=1
Convolution              convrelu_3               1 1 4 5 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Pooling                  maxpool2d_17             1 1 5 6 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_4               1 1 6 7 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912 9=1
Convolution              convrelu_5               1 1 7 8 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              convrelu_6               1 1 8 9 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Pooling                  maxpool2d_18             1 1 9 10 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_7               1 1 10 11 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648 9=1
Convolution              convrelu_8               1 1 11 12 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=1
Convolution              convrelu_9               1 1 12 13 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=1
Pooling                  maxpool2d_19             1 1 13 14 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              convrelu_10              1 1 14 15 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=1
Convolution              convrelu_11              1 1 15 16 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=1
Convolution              convrelu_12              1 1 16 17 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=1
Pooling                  maxpool2d_20             1 1 17 18 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Pooling                  aap_37                   1 1 18 19 0=1 18=7 7=1 8=7
Flatten                  flatten_36               1 1 19 20
InnerProduct             fcrelu_0                 1 1 20 21 0=4096 1=1 2=102760448 9=1
InnerProduct             fcrelu_1                 1 1 21 22 0=4096 1=1 2=16777216 9=1
InnerProduct             linear_15                1 1 22 out0 0=1000 1=1 2=4096000
