7767517
70 75
Input                    input1                   0 1 input1
Padding                  63                       1 1 input1 63 0=4 1=4 2=4 3=4 4=2
Convolution              64                       1 1 63 64 0=32 1=9 5=1 6=7776
InstanceNorm             65                       1 1 64 65 0=32 1=1.000000e-05
ReLU                     66                       1 1 65 66
Padding                  67                       1 1 66 67 0=1 1=1 2=1 3=1 4=2
Convolution              68                       1 1 67 68 0=64 1=3 3=2 5=1 6=18432
InstanceNorm             69                       1 1 68 69 0=64 1=1.000000e-05
ReLU                     70                       1 1 69 70
Padding                  71                       1 1 70 71 0=1 1=1 2=1 3=1 4=2
Convolution              72                       1 1 71 72 0=128 1=3 3=2 5=1 6=73728
InstanceNorm             73                       1 1 72 73 0=128 1=1.000000e-05
ReLU                     74                       1 1 73 74
Split                    splitncnn_0              1 2 74 74_splitncnn_0 74_splitncnn_1
Padding                  75                       1 1 74_splitncnn_1 75 0=1 1=1 2=1 3=1 4=2
Convolution              76                       1 1 75 76 0=128 1=3 5=1 6=147456
InstanceNorm             77                       1 1 76 77 0=128 1=1.000000e-05
ReLU                     78                       1 1 77 78
Padding                  79                       1 1 78 79 0=1 1=1 2=1 3=1 4=2
Convolution              80                       1 1 79 80 0=128 1=3 5=1 6=147456
InstanceNorm             81                       1 1 80 81 0=128 1=1.000000e-05
BinaryOp                 82                       2 1 81 74_splitncnn_0 82
Split                    splitncnn_1              1 2 82 82_splitncnn_0 82_splitncnn_1
Padding                  83                       1 1 82_splitncnn_1 83 0=1 1=1 2=1 3=1 4=2
Convolution              84                       1 1 83 84 0=128 1=3 5=1 6=147456
InstanceNorm             85                       1 1 84 85 0=128 1=1.000000e-05
ReLU                     86                       1 1 85 86
Padding                  87                       1 1 86 87 0=1 1=1 2=1 3=1 4=2
Convolution              88                       1 1 87 88 0=128 1=3 5=1 6=147456
InstanceNorm             89                       1 1 88 89 0=128 1=1.000000e-05
BinaryOp                 90                       2 1 89 82_splitncnn_0 90
Split                    splitncnn_2              1 2 90 90_splitncnn_0 90_splitncnn_1
Padding                  91                       1 1 90_splitncnn_1 91 0=1 1=1 2=1 3=1 4=2
Convolution              92                       1 1 91 92 0=128 1=3 5=1 6=147456
InstanceNorm             93                       1 1 92 93 0=128 1=1.000000e-05
ReLU                     94                       1 1 93 94
Padding                  95                       1 1 94 95 0=1 1=1 2=1 3=1 4=2
Convolution              96                       1 1 95 96 0=128 1=3 5=1 6=147456
InstanceNorm             97                       1 1 96 97 0=128 1=1.000000e-05
BinaryOp                 98                       2 1 97 90_splitncnn_0 98
Split                    splitncnn_3              1 2 98 98_splitncnn_0 98_splitncnn_1
Padding                  99                       1 1 98_splitncnn_1 99 0=1 1=1 2=1 3=1 4=2
Convolution              100                      1 1 99 100 0=128 1=3 5=1 6=147456
InstanceNorm             101                      1 1 100 101 0=128 1=1.000000e-05
ReLU                     102                      1 1 101 102
Padding                  103                      1 1 102 103 0=1 1=1 2=1 3=1 4=2
Convolution              104                      1 1 103 104 0=128 1=3 5=1 6=147456
InstanceNorm             105                      1 1 104 105 0=128 1=1.000000e-05
BinaryOp                 106                      2 1 105 98_splitncnn_0 106
Split                    splitncnn_4              1 2 106 106_splitncnn_0 106_splitncnn_1
Padding                  107                      1 1 106_splitncnn_1 107 0=1 1=1 2=1 3=1 4=2
Convolution              108                      1 1 107 108 0=128 1=3 5=1 6=147456
InstanceNorm             109                      1 1 108 109 0=128 1=1.000000e-05
ReLU                     110                      1 1 109 110
Padding                  111                      1 1 110 111 0=1 1=1 2=1 3=1 4=2
Convolution              112                      1 1 111 112 0=128 1=3 5=1 6=147456
InstanceNorm             113                      1 1 112 113 0=128 1=1.000000e-05
BinaryOp                 114                      2 1 113 106_splitncnn_0 114
Interp                   139                      1 1 114 139 0=1 1=2.000000e+00 2=2.000000e+00
Padding                  140                      1 1 139 140 0=1 1=1 2=1 3=1 4=2
Convolution              141                      1 1 140 141 0=64 1=3 5=1 6=73728
InstanceNorm             142                      1 1 141 142 0=64 1=1.000000e-05
ReLU                     143                      1 1 142 143
Interp                   168                      1 1 143 168 0=1 1=2.000000e+00 2=2.000000e+00
Padding                  169                      1 1 168 169 0=1 1=1 2=1 3=1 4=2
Convolution              170                      1 1 169 170 0=32 1=3 5=1 6=18432
InstanceNorm             171                      1 1 170 171 0=32 1=1.000000e-05
ReLU                     172                      1 1 171 172
Padding                  173                      1 1 172 173 0=4 1=4 2=4 3=4 4=2
Convolution              output1                  1 1 173 output1 0=3 1=9 5=1 6=7776
