7767517
75 85
Input                    in0                      0 1 in0
Convolution              convclip_0               1 1 in0 1 0=32 1=3 3=2 4=1 5=1 6=864 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     convdwclip_0             1 1 1 2 0=32 1=3 4=1 5=1 6=288 7=32 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              conv_2                   1 1 2 3 0=16 1=1 5=1 6=512
Convolution              convclip_1               1 1 3 4 0=96 1=1 5=1 6=1536 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     convdwclip_1             1 1 4 5 0=96 1=3 3=2 4=1 5=1 6=864 7=96 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              conv_4                   1 1 5 6 0=24 1=1 5=1 6=2304
Split                    splitncnn_0              1 2 6 7 8
Convolution              convclip_2               1 1 8 9 0=144 1=1 5=1 6=3456 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     convdwclip_2             1 1 9 10 0=144 1=3 4=1 5=1 6=1296 7=144 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              conv_6                   1 1 10 11 0=24 1=1 5=1 6=3456
BinaryOp                 add_0                    2 1 7 11 12
Convolution              convclip_3               1 1 12 13 0=144 1=1 5=1 6=3456 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     convdwclip_3             1 1 13 14 0=144 1=3 3=2 4=1 5=1 6=1296 7=144 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              conv_8                   1 1 14 15 0=32 1=1 5=1 6=4608
Split                    splitncnn_1              1 2 15 16 17
Convolution              convclip_4               1 1 17 18 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     convdwclip_4             1 1 18 19 0=192 1=3 4=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              conv_10                  1 1 19 20 0=32 1=1 5=1 6=6144
BinaryOp                 add_1                    2 1 16 20 21
Split                    splitncnn_2              1 2 21 22 23
Convolution              convclip_5               1 1 23 24 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     convdwclip_5             1 1 24 25 0=192 1=3 4=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              conv_12                  1 1 25 26 0=32 1=1 5=1 6=6144
BinaryOp                 add_2                    2 1 22 26 27
Convolution              convclip_6               1 1 27 28 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     convdwclip_6             1 1 28 29 0=192 1=3 3=2 4=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              conv_14                  1 1 29 30 0=64 1=1 5=1 6=12288
Split                    splitncnn_3              1 2 30 31 32
Convolution              convclip_7               1 1 32 33 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     convdwclip_7             1 1 33 34 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              conv_16                  1 1 34 35 0=64 1=1 5=1 6=24576
BinaryOp                 add_3                    2 1 31 35 36
Split                    splitncnn_4              1 2 36 37 38
Convolution              convclip_8               1 1 38 39 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     convdwclip_8             1 1 39 40 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              conv_18                  1 1 40 41 0=64 1=1 5=1 6=24576
BinaryOp                 add_4                    2 1 37 41 42
Split                    splitncnn_5              1 2 42 43 44
Convolution              convclip_9               1 1 44 45 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     convdwclip_9             1 1 45 46 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              conv_20                  1 1 46 47 0=64 1=1 5=1 6=24576
BinaryOp                 add_5                    2 1 43 47 48
Convolution              convclip_10              1 1 48 49 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     convdwclip_10            1 1 49 50 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              conv_22                  1 1 50 51 0=96 1=1 5=1 6=36864
Split                    splitncnn_6              1 2 51 52 53
Convolution              convclip_11              1 1 53 54 0=576 1=1 5=1 6=55296 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     convdwclip_11            1 1 54 55 0=576 1=3 4=1 5=1 6=5184 7=576 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              conv_24                  1 1 55 56 0=96 1=1 5=1 6=55296
BinaryOp                 add_6                    2 1 52 56 57
Split                    splitncnn_7              1 2 57 58 59
Convolution              convclip_12              1 1 59 60 0=576 1=1 5=1 6=55296 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     convdwclip_12            1 1 60 61 0=576 1=3 4=1 5=1 6=5184 7=576 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              conv_26                  1 1 61 62 0=96 1=1 5=1 6=55296
BinaryOp                 add_7                    2 1 58 62 63
Convolution              convclip_13              1 1 63 64 0=576 1=1 5=1 6=55296 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     convdwclip_13            1 1 64 65 0=576 1=3 3=2 4=1 5=1 6=5184 7=576 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              conv_28                  1 1 65 66 0=160 1=1 5=1 6=92160
Split                    splitncnn_8              1 2 66 67 68
Convolution              convclip_14              1 1 68 69 0=960 1=1 5=1 6=153600 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     convdwclip_14            1 1 69 70 0=960 1=3 4=1 5=1 6=8640 7=960 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              conv_30                  1 1 70 71 0=160 1=1 5=1 6=153600
BinaryOp                 add_8                    2 1 67 71 72
Split                    splitncnn_9              1 2 72 73 74
Convolution              convclip_15              1 1 74 75 0=960 1=1 5=1 6=153600 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     convdwclip_15            1 1 75 76 0=960 1=3 4=1 5=1 6=8640 7=960 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              conv_32                  1 1 76 77 0=160 1=1 5=1 6=153600
BinaryOp                 add_9                    2 1 73 77 78
Convolution              convclip_16              1 1 78 79 0=960 1=1 5=1 6=153600 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     convdwclip_16            1 1 79 80 0=960 1=3 4=1 5=1 6=8640 7=960 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              conv_34                  1 1 80 81 0=320 1=1 5=1 6=307200
Convolution              convclip_17              1 1 81 82 0=1280 1=1 5=1 6=409600 9=3 -23310=2,0.000000e+00,6.000000e+00
Pooling                  gap_0                    1 1 82 84 0=1 4=1
InnerProduct             linear_36                1 1 84 out0 0=1000 1=1 2=1280000
