7767517
1125 1279
Input                    in0                      0 1 in0
MemoryData               pos_embed                0 1 1 0=192 1=576
Convolution              conv_38                  1 1 in0 2 0=192 1=16 11=16 12=1 13=16 14=0 2=1 3=16 4=0 5=1 6=147456
Reshape                  flatten_574              1 1 2 3 0=-1 1=192
Permute                  transpose_837            1 1 3 4 0=1
BinaryOp                 add_0                    2 1 4 1 5 0=0
Split                    splitncnn_0              1 2 5 6 7
MemoryData               blocks.0                 0 1 8 0=192
MemoryData               pnnx_unique_0            0 1 9 0=192
LayerNorm                ln_77                    1 1 7 10 0=192 1=1.000000e-06 2=1
InnerProduct             linear_154               1 1 10 11 0=576 1=1 2=110592
Reshape                  reshape_383              1 1 11 12 0=48 1=4 11=3 2=576
Permute                  permute_651              1 1 12 13 0=8
Slice                    unbind_0                 1 3 13 14 15 16 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_386              1 1 14 17 0=48 1=576 2=4
BinaryOp                 mul_1                    1 1 17 18 0=2 1=1 2=1.443376e-01
Reshape                  reshape_385              1 1 15 19 0=48 1=576 2=4
MatMul                   matmultransb_0           2 1 18 19 20 0=1
InnerProduct             linear_155               1 1 20 21 0=4 1=1 2=16
Softmax                  softmax_0                1 1 21 22 0=1 1=1
InnerProduct             linear_156               1 1 22 23 0=4 1=1 2=16
Reshape                  reshape_384              1 1 16 24 0=48 1=576 2=4
MatMul                   matmul_576               2 1 23 24 25
Permute                  transpose_839            1 1 25 26 0=0
Reshape                  reshape_387              1 1 26 27 0=192 1=576 2=1
InnerProduct             linear_157               1 1 27 28 0=192 1=1 2=36864
BinaryOp                 mul_2                    2 1 9 28 29 0=2
BinaryOp                 add_3                    2 1 6 29 30 0=0
Split                    splitncnn_1              1 2 30 31 32
LayerNorm                ln_78                    1 1 32 33 0=192 1=1.000000e-06 2=1
InnerProduct             linear_158               1 1 33 34 0=768 1=1 2=147456
GELU                     gelu_39                  1 1 34 35
InnerProduct             linear_159               1 1 35 36 0=192 1=1 2=147456
BinaryOp                 mul_4                    2 1 8 36 37 0=2
BinaryOp                 add_5                    2 1 31 37 38 0=0
Split                    splitncnn_2              1 2 38 39 40
MemoryData               blocks.1                 0 1 41 0=192
MemoryData               pnnx_unique_2            0 1 42 0=192
LayerNorm                ln_79                    1 1 40 43 0=192 1=1.000000e-06 2=1
InnerProduct             linear_160               1 1 43 44 0=576 1=1 2=110592
Reshape                  reshape_388              1 1 44 45 0=48 1=4 11=3 2=576
Permute                  permute_656              1 1 45 46 0=8
Slice                    unbind_1                 1 3 46 47 48 49 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_391              1 1 47 50 0=48 1=576 11=4 2=1
BinaryOp                 mul_6                    1 1 50 51 0=2 1=1 2=1.443376e-01
Reshape                  reshape_390              1 1 48 52 0=48 1=576 11=4 2=1
MatMul                   matmultransb_1           2 1 51 52 53 0=1
InnerProduct             linear_161               1 1 53 54 0=4 1=1 2=16
Softmax                  softmax_1                1 1 54 55 0=1 1=1
InnerProduct             linear_162               1 1 55 56 0=4 1=1 2=16
Reshape                  reshape_389              1 1 49 57 0=48 1=576 11=4 2=1
MatMul                   matmul_578               2 1 56 57 58
Permute                  transpose_841            1 1 58 59 0=0
Reshape                  reshape_392              1 1 59 60 0=192 1=576 2=1
InnerProduct             linear_163               1 1 60 61 0=192 1=1 2=36864
BinaryOp                 mul_7                    2 1 42 61 62 0=2
BinaryOp                 add_8                    2 1 39 62 63 0=0
Split                    splitncnn_3              1 2 63 64 65
LayerNorm                ln_80                    1 1 65 66 0=192 1=1.000000e-06 2=1
InnerProduct             linear_164               1 1 66 67 0=768 1=1 2=147456
GELU                     gelu_40                  1 1 67 68
InnerProduct             linear_165               1 1 68 69 0=192 1=1 2=147456
BinaryOp                 mul_9                    2 1 41 69 70 0=2
BinaryOp                 add_10                   2 1 64 70 71 0=0
Split                    splitncnn_4              1 2 71 72 73
MemoryData               blocks.2                 0 1 74 0=192
MemoryData               pnnx_unique_4            0 1 75 0=192
LayerNorm                ln_81                    1 1 73 76 0=192 1=1.000000e-06 2=1
InnerProduct             linear_166               1 1 76 77 0=576 1=1 2=110592
Reshape                  reshape_393              1 1 77 78 0=48 1=4 11=3 2=576
Permute                  permute_661              1 1 78 79 0=8
Slice                    unbind_2                 1 3 79 80 81 82 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_396              1 1 80 83 0=48 1=576 11=4 2=1
BinaryOp                 mul_11                   1 1 83 84 0=2 1=1 2=1.443376e-01
Reshape                  reshape_395              1 1 81 85 0=48 1=576 11=4 2=1
MatMul                   matmultransb_2           2 1 84 85 86 0=1
InnerProduct             linear_167               1 1 86 87 0=4 1=1 2=16
Softmax                  softmax_2                1 1 87 88 0=1 1=1
InnerProduct             linear_168               1 1 88 89 0=4 1=1 2=16
Reshape                  reshape_394              1 1 82 90 0=48 1=576 11=4 2=1
MatMul                   matmul_580               2 1 89 90 91
Permute                  transpose_843            1 1 91 92 0=0
Reshape                  reshape_397              1 1 92 93 0=192 1=576 2=1
InnerProduct             linear_169               1 1 93 94 0=192 1=1 2=36864
BinaryOp                 mul_12                   2 1 75 94 95 0=2
BinaryOp                 add_13                   2 1 72 95 96 0=0
Split                    splitncnn_5              1 2 96 97 98
LayerNorm                ln_82                    1 1 98 99 0=192 1=1.000000e-06 2=1
InnerProduct             linear_170               1 1 99 100 0=768 1=1 2=147456
GELU                     gelu_41                  1 1 100 101
InnerProduct             linear_171               1 1 101 102 0=192 1=1 2=147456
BinaryOp                 mul_14                   2 1 74 102 103 0=2
BinaryOp                 add_15                   2 1 97 103 104 0=0
Split                    splitncnn_6              1 2 104 105 106
MemoryData               blocks.3                 0 1 107 0=192
MemoryData               pnnx_unique_6            0 1 108 0=192
LayerNorm                ln_83                    1 1 106 109 0=192 1=1.000000e-06 2=1
InnerProduct             linear_172               1 1 109 110 0=576 1=1 2=110592
Reshape                  reshape_398              1 1 110 111 0=48 1=4 11=3 2=576
Permute                  permute_666              1 1 111 112 0=8
Slice                    unbind_3                 1 3 112 113 114 115 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_401              1 1 113 116 0=48 1=576 2=4
BinaryOp                 mul_16                   1 1 116 117 0=2 1=1 2=1.443376e-01
Reshape                  reshape_400              1 1 114 118 0=48 1=576 2=4
MatMul                   matmultransb_3           2 1 117 118 119 0=1
InnerProduct             linear_173               1 1 119 120 0=4 1=1 2=16
Softmax                  softmax_3                1 1 120 121 0=1 1=1
InnerProduct             linear_174               1 1 121 122 0=4 1=1 2=16
Reshape                  reshape_399              1 1 115 123 0=48 1=576 11=4 2=1
MatMul                   matmul_582               2 1 122 123 124
Permute                  transpose_845            1 1 124 125 0=0
Reshape                  reshape_402              1 1 125 126 0=192 1=576 2=1
InnerProduct             linear_175               1 1 126 127 0=192 1=1 2=36864
BinaryOp                 mul_17                   2 1 108 127 128 0=2
BinaryOp                 add_18                   2 1 105 128 129 0=0
Split                    splitncnn_7              1 2 129 130 131
LayerNorm                ln_84                    1 1 131 132 0=192 1=1.000000e-06 2=1
InnerProduct             linear_176               1 1 132 133 0=768 1=1 2=147456
GELU                     gelu_42                  1 1 133 134
InnerProduct             linear_177               1 1 134 135 0=192 1=1 2=147456
BinaryOp                 mul_19                   2 1 107 135 136 0=2
BinaryOp                 add_20                   2 1 130 136 137 0=0
Split                    splitncnn_8              1 2 137 138 139
MemoryData               blocks.4                 0 1 140 0=192
MemoryData               pnnx_unique_8            0 1 141 0=192
LayerNorm                ln_85                    1 1 139 142 0=192 1=1.000000e-06 2=1
InnerProduct             linear_178               1 1 142 143 0=576 1=1 2=110592
Reshape                  reshape_403              1 1 143 144 0=48 1=4 11=3 2=576
Permute                  permute_671              1 1 144 145 0=8
Slice                    unbind_4                 1 3 145 146 147 148 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_406              1 1 146 149 0=48 1=576 11=4 2=1
BinaryOp                 mul_21                   1 1 149 150 0=2 1=1 2=1.443376e-01
Reshape                  reshape_405              1 1 147 151 0=48 1=576 11=4 2=1
MatMul                   matmultransb_4           2 1 150 151 152 0=1
InnerProduct             linear_179               1 1 152 153 0=4 1=1 2=16
Softmax                  softmax_4                1 1 153 154 0=1 1=1
InnerProduct             linear_180               1 1 154 155 0=4 1=1 2=16
Reshape                  reshape_404              1 1 148 156 0=48 1=576 2=4
MatMul                   matmul_584               2 1 155 156 157
Permute                  transpose_847            1 1 157 158 0=0
Reshape                  reshape_407              1 1 158 159 0=192 1=576 2=1
InnerProduct             linear_181               1 1 159 160 0=192 1=1 2=36864
BinaryOp                 mul_22                   2 1 141 160 161 0=2
BinaryOp                 add_23                   2 1 138 161 162 0=0
Split                    splitncnn_9              1 2 162 163 164
LayerNorm                ln_86                    1 1 164 165 0=192 1=1.000000e-06 2=1
InnerProduct             linear_182               1 1 165 166 0=768 1=1 2=147456
GELU                     gelu_43                  1 1 166 167
InnerProduct             linear_183               1 1 167 168 0=192 1=1 2=147456
BinaryOp                 mul_24                   2 1 140 168 169 0=2
BinaryOp                 add_25                   2 1 163 169 170 0=0
Split                    splitncnn_10             1 2 170 171 172
MemoryData               blocks.5                 0 1 173 0=192
MemoryData               pnnx_unique_10           0 1 174 0=192
LayerNorm                ln_87                    1 1 172 175 0=192 1=1.000000e-06 2=1
InnerProduct             linear_184               1 1 175 176 0=576 1=1 2=110592
Reshape                  reshape_408              1 1 176 177 0=48 1=4 11=3 2=576
Permute                  permute_676              1 1 177 178 0=8
Slice                    unbind_5                 1 3 178 179 180 181 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_411              1 1 179 182 0=48 1=576 11=4 2=1
BinaryOp                 mul_26                   1 1 182 183 0=2 1=1 2=1.443376e-01
Reshape                  reshape_410              1 1 180 184 0=48 1=576 11=4 2=1
MatMul                   matmultransb_5           2 1 183 184 185 0=1
InnerProduct             linear_185               1 1 185 186 0=4 1=1 2=16
Softmax                  softmax_5                1 1 186 187 0=1 1=1
InnerProduct             linear_186               1 1 187 188 0=4 1=1 2=16
Reshape                  reshape_409              1 1 181 189 0=48 1=576 2=4
MatMul                   matmul_586               2 1 188 189 190
Permute                  transpose_849            1 1 190 191 0=0
Reshape                  reshape_412              1 1 191 192 0=192 1=576 2=1
InnerProduct             linear_187               1 1 192 193 0=192 1=1 2=36864
BinaryOp                 mul_27                   2 1 174 193 194 0=2
BinaryOp                 add_28                   2 1 171 194 195 0=0
Split                    splitncnn_11             1 2 195 196 197
LayerNorm                ln_88                    1 1 197 198 0=192 1=1.000000e-06 2=1
InnerProduct             linear_188               1 1 198 199 0=768 1=1 2=147456
GELU                     gelu_44                  1 1 199 200
InnerProduct             linear_189               1 1 200 201 0=192 1=1 2=147456
BinaryOp                 mul_29                   2 1 173 201 202 0=2
BinaryOp                 add_30                   2 1 196 202 203 0=0
Split                    splitncnn_12             1 2 203 204 205
MemoryData               blocks.6                 0 1 206 0=192
MemoryData               pnnx_unique_12           0 1 207 0=192
LayerNorm                ln_89                    1 1 205 208 0=192 1=1.000000e-06 2=1
InnerProduct             linear_190               1 1 208 209 0=576 1=1 2=110592
Reshape                  reshape_413              1 1 209 210 0=48 1=4 11=3 2=576
Permute                  permute_681              1 1 210 211 0=8
Slice                    unbind_6                 1 3 211 212 213 214 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_416              1 1 212 215 0=48 1=576 2=4
BinaryOp                 mul_31                   1 1 215 216 0=2 1=1 2=1.443376e-01
Reshape                  reshape_415              1 1 213 217 0=48 1=576 11=4 2=1
MatMul                   matmultransb_6           2 1 216 217 218 0=1
InnerProduct             linear_191               1 1 218 219 0=4 1=1 2=16
Softmax                  softmax_6                1 1 219 220 0=1 1=1
InnerProduct             linear_192               1 1 220 221 0=4 1=1 2=16
Reshape                  reshape_414              1 1 214 222 0=48 1=576 11=4 2=1
MatMul                   matmul_588               2 1 221 222 223
Permute                  transpose_851            1 1 223 224 0=0
Reshape                  reshape_417              1 1 224 225 0=192 1=576 2=1
InnerProduct             linear_193               1 1 225 226 0=192 1=1 2=36864
BinaryOp                 mul_32                   2 1 207 226 227 0=2
BinaryOp                 add_33                   2 1 204 227 228 0=0
Split                    splitncnn_13             1 2 228 229 230
LayerNorm                ln_90                    1 1 230 231 0=192 1=1.000000e-06 2=1
InnerProduct             linear_194               1 1 231 232 0=768 1=1 2=147456
GELU                     gelu_45                  1 1 232 233
InnerProduct             linear_195               1 1 233 234 0=192 1=1 2=147456
BinaryOp                 mul_34                   2 1 206 234 235 0=2
BinaryOp                 add_35                   2 1 229 235 236 0=0
Split                    splitncnn_14             1 2 236 237 238
MemoryData               blocks.7                 0 1 239 0=192
MemoryData               pnnx_unique_14           0 1 240 0=192
LayerNorm                ln_91                    1 1 238 241 0=192 1=1.000000e-06 2=1
InnerProduct             linear_196               1 1 241 242 0=576 1=1 2=110592
Reshape                  reshape_418              1 1 242 243 0=48 1=4 11=3 2=576
Permute                  permute_686              1 1 243 244 0=8
Slice                    unbind_7                 1 3 244 245 246 247 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_421              1 1 245 248 0=48 1=576 11=4 2=1
BinaryOp                 mul_36                   1 1 248 249 0=2 1=1 2=1.443376e-01
Reshape                  reshape_420              1 1 246 250 0=48 1=576 2=4
MatMul                   matmultransb_7           2 1 249 250 251 0=1
InnerProduct             linear_197               1 1 251 252 0=4 1=1 2=16
Softmax                  softmax_7                1 1 252 253 0=1 1=1
InnerProduct             linear_198               1 1 253 254 0=4 1=1 2=16
Reshape                  reshape_419              1 1 247 255 0=48 1=576 2=4
MatMul                   matmul_590               2 1 254 255 256
Permute                  transpose_853            1 1 256 257 0=0
Reshape                  reshape_422              1 1 257 258 0=192 1=576 2=1
InnerProduct             linear_199               1 1 258 259 0=192 1=1 2=36864
BinaryOp                 mul_37                   2 1 240 259 260 0=2
BinaryOp                 add_38                   2 1 237 260 261 0=0
Split                    splitncnn_15             1 2 261 262 263
LayerNorm                ln_92                    1 1 263 264 0=192 1=1.000000e-06 2=1
InnerProduct             linear_200               1 1 264 265 0=768 1=1 2=147456
GELU                     gelu_46                  1 1 265 266
InnerProduct             linear_201               1 1 266 267 0=192 1=1 2=147456
BinaryOp                 mul_39                   2 1 239 267 268 0=2
BinaryOp                 add_40                   2 1 262 268 269 0=0
Split                    splitncnn_16             1 2 269 270 271
MemoryData               blocks.8                 0 1 272 0=192
MemoryData               pnnx_unique_16           0 1 273 0=192
LayerNorm                ln_93                    1 1 271 274 0=192 1=1.000000e-06 2=1
InnerProduct             linear_202               1 1 274 275 0=576 1=1 2=110592
Reshape                  reshape_423              1 1 275 276 0=48 1=4 11=3 2=576
Permute                  permute_691              1 1 276 277 0=8
Slice                    unbind_8                 1 3 277 278 279 280 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_426              1 1 278 281 0=48 1=576 11=4 2=1
BinaryOp                 mul_41                   1 1 281 282 0=2 1=1 2=1.443376e-01
Reshape                  reshape_425              1 1 279 283 0=48 1=576 2=4
MatMul                   matmultransb_8           2 1 282 283 284 0=1
InnerProduct             linear_203               1 1 284 285 0=4 1=1 2=16
Softmax                  softmax_8                1 1 285 286 0=1 1=1
InnerProduct             linear_204               1 1 286 287 0=4 1=1 2=16
Reshape                  reshape_424              1 1 280 288 0=48 1=576 2=4
MatMul                   matmul_592               2 1 287 288 289
Permute                  transpose_855            1 1 289 290 0=0
Reshape                  reshape_427              1 1 290 291 0=192 1=576 2=1
InnerProduct             linear_205               1 1 291 292 0=192 1=1 2=36864
BinaryOp                 mul_42                   2 1 273 292 293 0=2
BinaryOp                 add_43                   2 1 270 293 294 0=0
Split                    splitncnn_17             1 2 294 295 296
LayerNorm                ln_94                    1 1 296 297 0=192 1=1.000000e-06 2=1
InnerProduct             linear_206               1 1 297 298 0=768 1=1 2=147456
GELU                     gelu_47                  1 1 298 299
InnerProduct             linear_207               1 1 299 300 0=192 1=1 2=147456
BinaryOp                 mul_44                   2 1 272 300 301 0=2
BinaryOp                 add_45                   2 1 295 301 302 0=0
Split                    splitncnn_18             1 2 302 303 304
MemoryData               blocks.9                 0 1 305 0=192
MemoryData               pnnx_unique_18           0 1 306 0=192
LayerNorm                ln_95                    1 1 304 307 0=192 1=1.000000e-06 2=1
InnerProduct             linear_208               1 1 307 308 0=576 1=1 2=110592
Reshape                  reshape_428              1 1 308 309 0=48 1=4 11=3 2=576
Permute                  permute_696              1 1 309 310 0=8
Slice                    unbind_9                 1 3 310 311 312 313 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_431              1 1 311 314 0=48 1=576 2=4
BinaryOp                 mul_46                   1 1 314 315 0=2 1=1 2=1.443376e-01
Reshape                  reshape_430              1 1 312 316 0=48 1=576 2=4
MatMul                   matmultransb_9           2 1 315 316 317 0=1
InnerProduct             linear_209               1 1 317 318 0=4 1=1 2=16
Softmax                  softmax_9                1 1 318 319 0=1 1=1
InnerProduct             linear_210               1 1 319 320 0=4 1=1 2=16
Reshape                  reshape_429              1 1 313 321 0=48 1=576 11=4 2=1
MatMul                   matmul_594               2 1 320 321 322
Permute                  transpose_857            1 1 322 323 0=0
Reshape                  reshape_432              1 1 323 324 0=192 1=576 2=1
InnerProduct             linear_211               1 1 324 325 0=192 1=1 2=36864
BinaryOp                 mul_47                   2 1 306 325 326 0=2
BinaryOp                 add_48                   2 1 303 326 327 0=0
Split                    splitncnn_19             1 2 327 328 329
LayerNorm                ln_96                    1 1 329 330 0=192 1=1.000000e-06 2=1
InnerProduct             linear_212               1 1 330 331 0=768 1=1 2=147456
GELU                     gelu_48                  1 1 331 332
InnerProduct             linear_213               1 1 332 333 0=192 1=1 2=147456
BinaryOp                 mul_49                   2 1 305 333 334 0=2
BinaryOp                 add_50                   2 1 328 334 335 0=0
Split                    splitncnn_20             1 2 335 336 337
MemoryData               blocks.10                0 1 338 0=192
MemoryData               pnnx_unique_20           0 1 339 0=192
LayerNorm                ln_97                    1 1 337 340 0=192 1=1.000000e-06 2=1
InnerProduct             linear_214               1 1 340 341 0=576 1=1 2=110592
Reshape                  reshape_433              1 1 341 342 0=48 1=4 11=3 2=576
Permute                  permute_701              1 1 342 343 0=8
Slice                    unbind_10                1 3 343 344 345 346 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_436              1 1 344 347 0=48 1=576 2=4
BinaryOp                 mul_51                   1 1 347 348 0=2 1=1 2=1.443376e-01
Reshape                  reshape_435              1 1 345 349 0=48 1=576 2=4
MatMul                   matmultransb_10          2 1 348 349 350 0=1
InnerProduct             linear_215               1 1 350 351 0=4 1=1 2=16
Softmax                  softmax_10               1 1 351 352 0=1 1=1
InnerProduct             linear_216               1 1 352 353 0=4 1=1 2=16
Reshape                  reshape_434              1 1 346 354 0=48 1=576 2=4
MatMul                   matmul_596               2 1 353 354 355
Permute                  transpose_859            1 1 355 356 0=0
Reshape                  reshape_437              1 1 356 357 0=192 1=576 2=1
InnerProduct             linear_217               1 1 357 358 0=192 1=1 2=36864
BinaryOp                 mul_52                   2 1 339 358 359 0=2
BinaryOp                 add_53                   2 1 336 359 360 0=0
Split                    splitncnn_21             1 2 360 361 362
LayerNorm                ln_98                    1 1 362 363 0=192 1=1.000000e-06 2=1
InnerProduct             linear_218               1 1 363 364 0=768 1=1 2=147456
GELU                     gelu_49                  1 1 364 365
InnerProduct             linear_219               1 1 365 366 0=192 1=1 2=147456
BinaryOp                 mul_54                   2 1 338 366 367 0=2
BinaryOp                 add_55                   2 1 361 367 368 0=0
Split                    splitncnn_22             1 2 368 369 370
MemoryData               blocks.11                0 1 371 0=192
MemoryData               pnnx_unique_22           0 1 372 0=192
LayerNorm                ln_99                    1 1 370 373 0=192 1=1.000000e-06 2=1
InnerProduct             linear_220               1 1 373 374 0=576 1=1 2=110592
Reshape                  reshape_438              1 1 374 375 0=48 1=4 11=3 2=576
Permute                  permute_706              1 1 375 376 0=8
Slice                    unbind_11                1 3 376 377 378 379 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_441              1 1 377 380 0=48 1=576 11=4 2=1
BinaryOp                 mul_56                   1 1 380 381 0=2 1=1 2=1.443376e-01
Reshape                  reshape_440              1 1 378 382 0=48 1=576 11=4 2=1
MatMul                   matmultransb_11          2 1 381 382 383 0=1
InnerProduct             linear_221               1 1 383 384 0=4 1=1 2=16
Softmax                  softmax_11               1 1 384 385 0=1 1=1
InnerProduct             linear_222               1 1 385 386 0=4 1=1 2=16
Reshape                  reshape_439              1 1 379 387 0=48 1=576 2=4
MatMul                   matmul_598               2 1 386 387 388
Permute                  transpose_861            1 1 388 389 0=0
Reshape                  reshape_442              1 1 389 390 0=192 1=576 2=1
InnerProduct             linear_223               1 1 390 391 0=192 1=1 2=36864
BinaryOp                 mul_57                   2 1 372 391 392 0=2
BinaryOp                 add_58                   2 1 369 392 393 0=0
Split                    splitncnn_23             1 2 393 394 395
LayerNorm                ln_100                   1 1 395 396 0=192 1=1.000000e-06 2=1
InnerProduct             linear_224               1 1 396 397 0=768 1=1 2=147456
GELU                     gelu_50                  1 1 397 398
InnerProduct             linear_225               1 1 398 399 0=192 1=1 2=147456
BinaryOp                 mul_59                   2 1 371 399 400 0=2
BinaryOp                 add_60                   2 1 394 400 401 0=0
Split                    splitncnn_24             1 2 401 402 403
MemoryData               blocks.12                0 1 404 0=192
MemoryData               pnnx_unique_24           0 1 405 0=192
LayerNorm                ln_101                   1 1 403 406 0=192 1=1.000000e-06 2=1
InnerProduct             linear_226               1 1 406 407 0=576 1=1 2=110592
Reshape                  reshape_443              1 1 407 408 0=48 1=4 11=3 2=576
Permute                  permute_711              1 1 408 409 0=8
Slice                    unbind_12                1 3 409 410 411 412 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_446              1 1 410 413 0=48 1=576 11=4 2=1
BinaryOp                 mul_61                   1 1 413 414 0=2 1=1 2=1.443376e-01
Reshape                  reshape_445              1 1 411 415 0=48 1=576 11=4 2=1
MatMul                   matmultransb_12          2 1 414 415 416 0=1
InnerProduct             linear_227               1 1 416 417 0=4 1=1 2=16
Softmax                  softmax_12               1 1 417 418 0=1 1=1
InnerProduct             linear_228               1 1 418 419 0=4 1=1 2=16
Reshape                  reshape_444              1 1 412 420 0=48 1=576 11=4 2=1
MatMul                   matmul_600               2 1 419 420 421
Permute                  transpose_863            1 1 421 422 0=0
Reshape                  reshape_447              1 1 422 423 0=192 1=576 2=1
InnerProduct             linear_229               1 1 423 424 0=192 1=1 2=36864
BinaryOp                 mul_62                   2 1 405 424 425 0=2
BinaryOp                 add_63                   2 1 402 425 426 0=0
Split                    splitncnn_25             1 2 426 427 428
LayerNorm                ln_102                   1 1 428 429 0=192 1=1.000000e-06 2=1
InnerProduct             linear_230               1 1 429 430 0=768 1=1 2=147456
GELU                     gelu_51                  1 1 430 431
InnerProduct             linear_231               1 1 431 432 0=192 1=1 2=147456
BinaryOp                 mul_64                   2 1 404 432 433 0=2
BinaryOp                 add_65                   2 1 427 433 434 0=0
Split                    splitncnn_26             1 2 434 435 436
MemoryData               blocks.13                0 1 437 0=192
MemoryData               pnnx_unique_26           0 1 438 0=192
LayerNorm                ln_103                   1 1 436 439 0=192 1=1.000000e-06 2=1
InnerProduct             linear_232               1 1 439 440 0=576 1=1 2=110592
Reshape                  reshape_448              1 1 440 441 0=48 1=4 11=3 2=576
Permute                  permute_716              1 1 441 442 0=8
Slice                    unbind_13                1 3 442 443 444 445 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_451              1 1 443 446 0=48 1=576 11=4 2=1
BinaryOp                 mul_66                   1 1 446 447 0=2 1=1 2=1.443376e-01
Reshape                  reshape_450              1 1 444 448 0=48 1=576 2=4
MatMul                   matmultransb_13          2 1 447 448 449 0=1
InnerProduct             linear_233               1 1 449 450 0=4 1=1 2=16
Softmax                  softmax_13               1 1 450 451 0=1 1=1
InnerProduct             linear_234               1 1 451 452 0=4 1=1 2=16
Reshape                  reshape_449              1 1 445 453 0=48 1=576 2=4
MatMul                   matmul_602               2 1 452 453 454
Permute                  transpose_865            1 1 454 455 0=0
Reshape                  reshape_452              1 1 455 456 0=192 1=576 2=1
InnerProduct             linear_235               1 1 456 457 0=192 1=1 2=36864
BinaryOp                 mul_67                   2 1 438 457 458 0=2
BinaryOp                 add_68                   2 1 435 458 459 0=0
Split                    splitncnn_27             1 2 459 460 461
LayerNorm                ln_104                   1 1 461 462 0=192 1=1.000000e-06 2=1
InnerProduct             linear_236               1 1 462 463 0=768 1=1 2=147456
GELU                     gelu_52                  1 1 463 464
InnerProduct             linear_237               1 1 464 465 0=192 1=1 2=147456
BinaryOp                 mul_69                   2 1 437 465 466 0=2
BinaryOp                 add_70                   2 1 460 466 467 0=0
Split                    splitncnn_28             1 2 467 468 469
MemoryData               blocks.14                0 1 470 0=192
MemoryData               pnnx_unique_28           0 1 471 0=192
LayerNorm                ln_105                   1 1 469 472 0=192 1=1.000000e-06 2=1
InnerProduct             linear_238               1 1 472 473 0=576 1=1 2=110592
Reshape                  reshape_453              1 1 473 474 0=48 1=4 11=3 2=576
Permute                  permute_721              1 1 474 475 0=8
Slice                    unbind_14                1 3 475 476 477 478 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_456              1 1 476 479 0=48 1=576 11=4 2=1
BinaryOp                 mul_71                   1 1 479 480 0=2 1=1 2=1.443376e-01
Reshape                  reshape_455              1 1 477 481 0=48 1=576 11=4 2=1
MatMul                   matmultransb_14          2 1 480 481 482 0=1
InnerProduct             linear_239               1 1 482 483 0=4 1=1 2=16
Softmax                  softmax_14               1 1 483 484 0=1 1=1
InnerProduct             linear_240               1 1 484 485 0=4 1=1 2=16
Reshape                  reshape_454              1 1 478 486 0=48 1=576 11=4 2=1
MatMul                   matmul_604               2 1 485 486 487
Permute                  transpose_867            1 1 487 488 0=0
Reshape                  reshape_457              1 1 488 489 0=192 1=576 2=1
InnerProduct             linear_241               1 1 489 490 0=192 1=1 2=36864
BinaryOp                 mul_72                   2 1 471 490 491 0=2
BinaryOp                 add_73                   2 1 468 491 492 0=0
Split                    splitncnn_29             1 2 492 493 494
LayerNorm                ln_106                   1 1 494 495 0=192 1=1.000000e-06 2=1
InnerProduct             linear_242               1 1 495 496 0=768 1=1 2=147456
GELU                     gelu_53                  1 1 496 497
InnerProduct             linear_243               1 1 497 498 0=192 1=1 2=147456
BinaryOp                 mul_74                   2 1 470 498 499 0=2
BinaryOp                 add_75                   2 1 493 499 500 0=0
Split                    splitncnn_30             1 2 500 501 502
MemoryData               blocks.15                0 1 503 0=192
MemoryData               pnnx_unique_30           0 1 504 0=192
LayerNorm                ln_107                   1 1 502 505 0=192 1=1.000000e-06 2=1
InnerProduct             linear_244               1 1 505 506 0=576 1=1 2=110592
Reshape                  reshape_458              1 1 506 507 0=48 1=4 11=3 2=576
Permute                  permute_726              1 1 507 508 0=8
Slice                    unbind_15                1 3 508 509 510 511 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_461              1 1 509 512 0=48 1=576 11=4 2=1
BinaryOp                 mul_76                   1 1 512 513 0=2 1=1 2=1.443376e-01
Reshape                  reshape_460              1 1 510 514 0=48 1=576 2=4
MatMul                   matmultransb_15          2 1 513 514 515 0=1
InnerProduct             linear_245               1 1 515 516 0=4 1=1 2=16
Softmax                  softmax_15               1 1 516 517 0=1 1=1
InnerProduct             linear_246               1 1 517 518 0=4 1=1 2=16
Reshape                  reshape_459              1 1 511 519 0=48 1=576 2=4
MatMul                   matmul_606               2 1 518 519 520
Permute                  transpose_869            1 1 520 521 0=0
Reshape                  reshape_462              1 1 521 522 0=192 1=576 2=1
InnerProduct             linear_247               1 1 522 523 0=192 1=1 2=36864
BinaryOp                 mul_77                   2 1 504 523 524 0=2
BinaryOp                 add_78                   2 1 501 524 525 0=0
Split                    splitncnn_31             1 2 525 526 527
LayerNorm                ln_108                   1 1 527 528 0=192 1=1.000000e-06 2=1
InnerProduct             linear_248               1 1 528 529 0=768 1=1 2=147456
GELU                     gelu_54                  1 1 529 530
InnerProduct             linear_249               1 1 530 531 0=192 1=1 2=147456
BinaryOp                 mul_79                   2 1 503 531 532 0=2
BinaryOp                 add_80                   2 1 526 532 533 0=0
Split                    splitncnn_32             1 2 533 534 535
MemoryData               blocks.16                0 1 536 0=192
MemoryData               pnnx_unique_32           0 1 537 0=192
LayerNorm                ln_109                   1 1 535 538 0=192 1=1.000000e-06 2=1
InnerProduct             linear_250               1 1 538 539 0=576 1=1 2=110592
Reshape                  reshape_463              1 1 539 540 0=48 1=4 11=3 2=576
Permute                  permute_731              1 1 540 541 0=8
Slice                    unbind_16                1 3 541 542 543 544 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_466              1 1 542 545 0=48 1=576 2=4
BinaryOp                 mul_81                   1 1 545 546 0=2 1=1 2=1.443376e-01
Reshape                  reshape_465              1 1 543 547 0=48 1=576 2=4
MatMul                   matmultransb_16          2 1 546 547 548 0=1
InnerProduct             linear_251               1 1 548 549 0=4 1=1 2=16
Softmax                  softmax_16               1 1 549 550 0=1 1=1
InnerProduct             linear_252               1 1 550 551 0=4 1=1 2=16
Reshape                  reshape_464              1 1 544 552 0=48 1=576 2=4
MatMul                   matmul_608               2 1 551 552 553
Permute                  transpose_871            1 1 553 554 0=0
Reshape                  reshape_467              1 1 554 555 0=192 1=576 2=1
InnerProduct             linear_253               1 1 555 556 0=192 1=1 2=36864
BinaryOp                 mul_82                   2 1 537 556 557 0=2
BinaryOp                 add_83                   2 1 534 557 558 0=0
Split                    splitncnn_33             1 2 558 559 560
LayerNorm                ln_110                   1 1 560 561 0=192 1=1.000000e-06 2=1
InnerProduct             linear_254               1 1 561 562 0=768 1=1 2=147456
GELU                     gelu_55                  1 1 562 563
InnerProduct             linear_255               1 1 563 564 0=192 1=1 2=147456
BinaryOp                 mul_84                   2 1 536 564 565 0=2
BinaryOp                 add_85                   2 1 559 565 566 0=0
Split                    splitncnn_34             1 2 566 567 568
MemoryData               blocks.17                0 1 569 0=192
MemoryData               pnnx_unique_34           0 1 570 0=192
LayerNorm                ln_111                   1 1 568 571 0=192 1=1.000000e-06 2=1
InnerProduct             linear_256               1 1 571 572 0=576 1=1 2=110592
Reshape                  reshape_468              1 1 572 573 0=48 1=4 11=3 2=576
Permute                  permute_736              1 1 573 574 0=8
Slice                    unbind_17                1 3 574 575 576 577 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_471              1 1 575 578 0=48 1=576 2=4
BinaryOp                 mul_86                   1 1 578 579 0=2 1=1 2=1.443376e-01
Reshape                  reshape_470              1 1 576 580 0=48 1=576 11=4 2=1
MatMul                   matmultransb_17          2 1 579 580 581 0=1
InnerProduct             linear_257               1 1 581 582 0=4 1=1 2=16
Softmax                  softmax_17               1 1 582 583 0=1 1=1
InnerProduct             linear_258               1 1 583 584 0=4 1=1 2=16
Reshape                  reshape_469              1 1 577 585 0=48 1=576 2=4
MatMul                   matmul_610               2 1 584 585 586
Permute                  transpose_873            1 1 586 587 0=0
Reshape                  reshape_472              1 1 587 588 0=192 1=576 2=1
InnerProduct             linear_259               1 1 588 589 0=192 1=1 2=36864
BinaryOp                 mul_87                   2 1 570 589 590 0=2
BinaryOp                 add_88                   2 1 567 590 591 0=0
Split                    splitncnn_35             1 2 591 592 593
LayerNorm                ln_112                   1 1 593 594 0=192 1=1.000000e-06 2=1
InnerProduct             linear_260               1 1 594 595 0=768 1=1 2=147456
GELU                     gelu_56                  1 1 595 596
InnerProduct             linear_261               1 1 596 597 0=192 1=1 2=147456
BinaryOp                 mul_89                   2 1 569 597 598 0=2
BinaryOp                 add_90                   2 1 592 598 599 0=0
Split                    splitncnn_36             1 2 599 600 601
MemoryData               blocks.18                0 1 602 0=192
MemoryData               pnnx_unique_36           0 1 603 0=192
LayerNorm                ln_113                   1 1 601 604 0=192 1=1.000000e-06 2=1
InnerProduct             linear_262               1 1 604 605 0=576 1=1 2=110592
Reshape                  reshape_473              1 1 605 606 0=48 1=4 11=3 2=576
Permute                  permute_741              1 1 606 607 0=8
Slice                    unbind_18                1 3 607 608 609 610 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_476              1 1 608 611 0=48 1=576 11=4 2=1
BinaryOp                 mul_91                   1 1 611 612 0=2 1=1 2=1.443376e-01
Reshape                  reshape_475              1 1 609 613 0=48 1=576 2=4
MatMul                   matmultransb_18          2 1 612 613 614 0=1
InnerProduct             linear_263               1 1 614 615 0=4 1=1 2=16
Softmax                  softmax_18               1 1 615 616 0=1 1=1
InnerProduct             linear_264               1 1 616 617 0=4 1=1 2=16
Reshape                  reshape_474              1 1 610 618 0=48 1=576 2=4
MatMul                   matmul_612               2 1 617 618 619
Permute                  transpose_875            1 1 619 620 0=0
Reshape                  reshape_477              1 1 620 621 0=192 1=576 2=1
InnerProduct             linear_265               1 1 621 622 0=192 1=1 2=36864
BinaryOp                 mul_92                   2 1 603 622 623 0=2
BinaryOp                 add_93                   2 1 600 623 624 0=0
Split                    splitncnn_37             1 2 624 625 626
LayerNorm                ln_114                   1 1 626 627 0=192 1=1.000000e-06 2=1
InnerProduct             linear_266               1 1 627 628 0=768 1=1 2=147456
GELU                     gelu_57                  1 1 628 629
InnerProduct             linear_267               1 1 629 630 0=192 1=1 2=147456
BinaryOp                 mul_94                   2 1 602 630 631 0=2
BinaryOp                 add_95                   2 1 625 631 632 0=0
Split                    splitncnn_38             1 2 632 633 634
MemoryData               blocks.19                0 1 635 0=192
MemoryData               pnnx_unique_38           0 1 636 0=192
LayerNorm                ln_115                   1 1 634 637 0=192 1=1.000000e-06 2=1
InnerProduct             linear_268               1 1 637 638 0=576 1=1 2=110592
Reshape                  reshape_478              1 1 638 639 0=48 1=4 11=3 2=576
Permute                  permute_746              1 1 639 640 0=8
Slice                    unbind_19                1 3 640 641 642 643 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_481              1 1 641 644 0=48 1=576 2=4
BinaryOp                 mul_96                   1 1 644 645 0=2 1=1 2=1.443376e-01
Reshape                  reshape_480              1 1 642 646 0=48 1=576 11=4 2=1
MatMul                   matmultransb_19          2 1 645 646 647 0=1
InnerProduct             linear_269               1 1 647 648 0=4 1=1 2=16
Softmax                  softmax_19               1 1 648 649 0=1 1=1
InnerProduct             linear_270               1 1 649 650 0=4 1=1 2=16
Reshape                  reshape_479              1 1 643 651 0=48 1=576 2=4
MatMul                   matmul_614               2 1 650 651 652
Permute                  transpose_877            1 1 652 653 0=0
Reshape                  reshape_482              1 1 653 654 0=192 1=576 2=1
InnerProduct             linear_271               1 1 654 655 0=192 1=1 2=36864
BinaryOp                 mul_97                   2 1 636 655 656 0=2
BinaryOp                 add_98                   2 1 633 656 657 0=0
Split                    splitncnn_39             1 2 657 658 659
LayerNorm                ln_116                   1 1 659 660 0=192 1=1.000000e-06 2=1
InnerProduct             linear_272               1 1 660 661 0=768 1=1 2=147456
GELU                     gelu_58                  1 1 661 662
InnerProduct             linear_273               1 1 662 663 0=192 1=1 2=147456
BinaryOp                 mul_99                   2 1 635 663 664 0=2
BinaryOp                 add_100                  2 1 658 664 665 0=0
Split                    splitncnn_40             1 2 665 666 667
MemoryData               blocks.20                0 1 668 0=192
MemoryData               pnnx_unique_40           0 1 669 0=192
LayerNorm                ln_117                   1 1 667 670 0=192 1=1.000000e-06 2=1
InnerProduct             linear_274               1 1 670 671 0=576 1=1 2=110592
Reshape                  reshape_483              1 1 671 672 0=48 1=4 11=3 2=576
Permute                  permute_751              1 1 672 673 0=8
Slice                    unbind_20                1 3 673 674 675 676 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_486              1 1 674 677 0=48 1=576 2=4
BinaryOp                 mul_101                  1 1 677 678 0=2 1=1 2=1.443376e-01
Reshape                  reshape_485              1 1 675 679 0=48 1=576 2=4
MatMul                   matmultransb_20          2 1 678 679 680 0=1
InnerProduct             linear_275               1 1 680 681 0=4 1=1 2=16
Softmax                  softmax_20               1 1 681 682 0=1 1=1
InnerProduct             linear_276               1 1 682 683 0=4 1=1 2=16
Reshape                  reshape_484              1 1 676 684 0=48 1=576 2=4
MatMul                   matmul_616               2 1 683 684 685
Permute                  transpose_879            1 1 685 686 0=0
Reshape                  reshape_487              1 1 686 687 0=192 1=576 2=1
InnerProduct             linear_277               1 1 687 688 0=192 1=1 2=36864
BinaryOp                 mul_102                  2 1 669 688 689 0=2
BinaryOp                 add_103                  2 1 666 689 690 0=0
Split                    splitncnn_41             1 2 690 691 692
LayerNorm                ln_118                   1 1 692 693 0=192 1=1.000000e-06 2=1
InnerProduct             linear_278               1 1 693 694 0=768 1=1 2=147456
GELU                     gelu_59                  1 1 694 695
InnerProduct             linear_279               1 1 695 696 0=192 1=1 2=147456
BinaryOp                 mul_104                  2 1 668 696 697 0=2
BinaryOp                 add_105                  2 1 691 697 698 0=0
Split                    splitncnn_42             1 2 698 699 700
MemoryData               blocks.21                0 1 701 0=192
MemoryData               pnnx_unique_42           0 1 702 0=192
LayerNorm                ln_119                   1 1 700 703 0=192 1=1.000000e-06 2=1
InnerProduct             linear_280               1 1 703 704 0=576 1=1 2=110592
Reshape                  reshape_488              1 1 704 705 0=48 1=4 11=3 2=576
Permute                  permute_756              1 1 705 706 0=8
Slice                    unbind_21                1 3 706 707 708 709 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_491              1 1 707 710 0=48 1=576 11=4 2=1
BinaryOp                 mul_106                  1 1 710 711 0=2 1=1 2=1.443376e-01
Reshape                  reshape_490              1 1 708 712 0=48 1=576 11=4 2=1
MatMul                   matmultransb_21          2 1 711 712 713 0=1
InnerProduct             linear_281               1 1 713 714 0=4 1=1 2=16
Softmax                  softmax_21               1 1 714 715 0=1 1=1
InnerProduct             linear_282               1 1 715 716 0=4 1=1 2=16
Reshape                  reshape_489              1 1 709 717 0=48 1=576 2=4
MatMul                   matmul_618               2 1 716 717 718
Permute                  transpose_881            1 1 718 719 0=0
Reshape                  reshape_492              1 1 719 720 0=192 1=576 2=1
InnerProduct             linear_283               1 1 720 721 0=192 1=1 2=36864
BinaryOp                 mul_107                  2 1 702 721 722 0=2
BinaryOp                 add_108                  2 1 699 722 723 0=0
Split                    splitncnn_43             1 2 723 724 725
LayerNorm                ln_120                   1 1 725 726 0=192 1=1.000000e-06 2=1
InnerProduct             linear_284               1 1 726 727 0=768 1=1 2=147456
GELU                     gelu_60                  1 1 727 728
InnerProduct             linear_285               1 1 728 729 0=192 1=1 2=147456
BinaryOp                 mul_109                  2 1 701 729 730 0=2
BinaryOp                 add_110                  2 1 724 730 731 0=0
Split                    splitncnn_44             1 2 731 732 733
MemoryData               blocks.22                0 1 734 0=192
MemoryData               pnnx_unique_44           0 1 735 0=192
LayerNorm                ln_121                   1 1 733 736 0=192 1=1.000000e-06 2=1
InnerProduct             linear_286               1 1 736 737 0=576 1=1 2=110592
Reshape                  reshape_493              1 1 737 738 0=48 1=4 11=3 2=576
Permute                  permute_761              1 1 738 739 0=8
Slice                    unbind_22                1 3 739 740 741 742 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_496              1 1 740 743 0=48 1=576 2=4
BinaryOp                 mul_111                  1 1 743 744 0=2 1=1 2=1.443376e-01
Reshape                  reshape_495              1 1 741 745 0=48 1=576 2=4
MatMul                   matmultransb_22          2 1 744 745 746 0=1
InnerProduct             linear_287               1 1 746 747 0=4 1=1 2=16
Softmax                  softmax_22               1 1 747 748 0=1 1=1
InnerProduct             linear_288               1 1 748 749 0=4 1=1 2=16
Reshape                  reshape_494              1 1 742 750 0=48 1=576 2=4
MatMul                   matmul_620               2 1 749 750 751
Permute                  transpose_883            1 1 751 752 0=0
Reshape                  reshape_497              1 1 752 753 0=192 1=576 2=1
InnerProduct             linear_289               1 1 753 754 0=192 1=1 2=36864
BinaryOp                 mul_112                  2 1 735 754 755 0=2
BinaryOp                 add_113                  2 1 732 755 756 0=0
Split                    splitncnn_45             1 2 756 757 758
LayerNorm                ln_122                   1 1 758 759 0=192 1=1.000000e-06 2=1
InnerProduct             linear_290               1 1 759 760 0=768 1=1 2=147456
GELU                     gelu_61                  1 1 760 761
InnerProduct             linear_291               1 1 761 762 0=192 1=1 2=147456
